bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
#include <string.h>

#include <bl808_isp.h>
#include <isp_tg_reg.h>
#include <isp_auto_reg.h>
#include <isp_blae_reg.h>
#include <isp_blawb_reg.h>
#include <isp_gamma_reg.h>

#include <isp_front_reg.h>
#include <isp_middle_reg.h>
#include <isp_middle2_reg.h>
#include <isp_middle3_reg.h>
#include <isp_middle4_reg.h>
#include <isp_middle5_reg.h>
#include <isp_blback_reg.h>

#include <mm_glb_reg.h>

#include "bflb_platform.h"

/* accrording TestPatternClampRGBgainDlg.cpp */
#define ISP_BLC_MAX  1023
#define ISP_BLC_MIN 0

#define ISP_BNR_WEIGHT_MAX  64
#define ISP_BNR_WEIGHT_MIN  0
#define ISP_BNR_LPF_WEIGHT_MAX  16
#define ISP_BNR_LPF_WEIGHT_MIN  0
#define ISP_BNR_BASE_MAX 1023
#define ISP_BNR_SLOPE_MAX 255
#define ISP_BNR_SLOPE_GAIN_MAX 63
#define ISP_BNR_FB_LPF_WGT_MAX 16
#define ISP_BNR_FB_LVL_MAX 7

#define ISP_GAIN_MAX 2047
#define ISP_GAIN_MIN 0

#define ISP_CCM_MAX 2047
#define ISP_CCM_MIN -2048

#define ISP_CCM_OFFSET_MAX 4095
#define ISP_CCM_OFFSET_MIN -4096

#define ISP_DIGITAL_GAIN_MAX 65535
#define ISP_DIGITAL_GAIN_MIN 0

#define ISP_BRIGHTNESS_MAX  127
#define ISP_BRIGHTNESS_MIN  -128

#define ISP_CONTRAST_MAX  255
#define ISP_CONTRAST_MIN  0

#define ISP_SATURATION_MAX  255
#define ISP_SATURATION_MIN  0

#define ISP_SOLAR_SEPIA_MAX 255
#define ISP_SOLAR_SEPIA_MIN 0

#define ISP_SOLAR_THRED_MAX 255
#define ISP_SOLAR_THRED_MIN 0

#define ISP_NOISE_LEVEL_MAX  63
#define ISP_NOISE_LEVEL_MIN  0

#define ISP_NOISE_THRESHOLD_MAX  127
#define ISP_NOISE_THRESHOLD_MIN  0

#define ISP_NR_HSIZE_MAX  65535
#define ISP_NR_HSIZE_MIN  0

#define ISP_NR_STRENGTH_MAX  15
#define ISP_NR_STRENGTH_MIN  0

#define ISP_Edge_Enhance_LEVEL_MAX  127
#define ISP_Edge_Enhance_LEVEL_MIN  0

#define ISP_Edge_Enhance_LIMIT_MAX  255
#define ISP_Edge_Enhance_LIMIT_MIN  0

#define ISP_Edge_Enhance_HPF_MAX  8
#define ISP_Edge_Enhance_HPF_MIN  0

#define ISP_DPC_TH_MAX  255
#define ISP_DPC_TH_MIN  0

#define ISP_DPC_POS_MAX  65535
#define ISP_DPC_POS_MIN  0

#define ISP_AE_SRAM_BANK1      (AE_SRAM_BASE)            // 0x30019000
#define ISP_AE_SRAM_BANK2      (AE_SRAM_BASE +  (768))   // 0x30019300

#define ISP_AE_ROI_START_X_RANGE_MAX        2047
#define ISP_AE_ROI_START_Y_RANGE_MAX        2047
#define ISP_AE_ROI_WIDTH_RANGE_MAX          2047
#define ISP_AE_ROI_WIDTH_RANGE_MIN          32
#define ISP_AE_ROI_HEIGHT_RANGE_MAX         2047
#define ISP_AE_ROI_HEIGHT_RANGE_MIN         2

#define ISP_AE_HIST_ROI_MAX 2047
#define ISP_AE_HIST_ROI_MIN 0

#define ISP_AE_GRID_WIDTH_RANGE_MAX     255
#define ISP_AE_GRID_WIDTH_RANGE_MIN     32
#define ISP_AE_GRID_HEIGHT_RANGE_MAX    255
#define ISP_AE_GRID_HEIGHT_RANGE_MIN    2
#define ISP_AE_GRID_NUM_X_RANGE_MAX     12
#define ISP_AE_GRID_NUM_X_RANGE_MIN     1
#define ISP_AE_GRID_NUM_Y_RANGE_MAX     8
#define ISP_AE_GRID_NUM_Y_RANGE_MIN     1

#define AE_HIST_SUM_ADDR_Y     ((uint32_t)0x30019600)
#define AE_HIST_SUM_ADDR_R     ((uint32_t)0x30019600)
#define AE_HIST_SUM_ADDR_GR    ((uint32_t)0x30019704)
#define AE_HIST_SUM_ADDR_GB    ((uint32_t)0x30019808)
#define AE_HIST_SUM_ADDR_B     ((uint32_t)0x3001990C)

#define ISP_AWB_SRAM_BANK1     (AWB_SRAM_BASE)            // 3001c000
#define ISP_AWB_SRAM_BANK2     (AWB_SRAM_BASE + (1024*8)) // 3001e000

#define AWB3_HIST_BUCKET_ADDR  ((uint32_t)0x30017000)
#define AWB3_HIST_BUCKET_NUM_MIN  1
#define AWB3_HIST_BUCKET_NUM_MAX  ISP_AWB3_HIST_BIN_NUM_MAX

#define ISP_AWB_ROI_START_X_RANGE_MAX       2047
#define ISP_AWB_ROI_START_Y_RANGE_MAX       2047
#define ISP_AWB_ROI_WIDTH_RANGE_MAX         2047
#define ISP_AWB_ROI_WIDTH_RANGE_MIN         32
#define ISP_AWB_ROI_HEIGHT_RANGE_MAX        2047
#define ISP_AWB_ROI_HEIGHT_RANGE_MIN        2

#define ISP_AWB_GRID_WIDTH_RANGE_MAX     255
#define ISP_AWB_GRID_WIDTH_RANGE_MIN     32
#define ISP_AWB_GRID_HEIGHT_RANGE_MAX    255
#define ISP_AWB_GRID_HEIGHT_RANGE_MIN    2
#define ISP_AWB_GRID_NUM_X_RANGE_MAX     32
#define ISP_AWB_GRID_NUM_X_RANGE_MIN     1
#define ISP_AWB_GRID_NUM_Y_RANGE_MAX     32
#define ISP_AWB_GRID_NUM_Y_RANGE_MIN     1

#define ISP_AWB_R_MAX_THR_RANGE_MAX     4095
#define ISP_AWB_R_MIN_THR_RANGE_MAX     4095
#define ISP_AWB_G_MAX_THR_RANGE_MAX     4095
#define ISP_AWB_G_MIN_THR_RANGE_MAX     4095
#define ISP_AWB_B_MAX_THR_RANGE_MAX     4095
#define ISP_AWB_B_MIN_THR_RANGE_MAX     4095

#define ISP_LSC_OFFSET_MAX      127
#define ISP_LSC_OFFSET_MIN      -128

#define ISP_EE_DIR_SHPNSS_THRESH_MAX        127
#define ISP_EE_NO_DIR_SHPNSS_THRESH_MAX     127
#define ISP_EE_FLAT_REGION_THRESH_MAX       255
#define ISP_EE_TEXTURE_REGION_THRESH_MAX    511
#define ISP_EE_EDGE_REGION_THRESH_MAX       65535

#define ISP_EE_STRENGTH_MAX         127
#define ISP_EE_NR_STRENGTH_MAX     255

#define ISP_EE_LUMA_WEIGHT_MAX     1023

#define ISP_CS_GAIN_MAX         511
#define ISP_CS_WEIGHT_MAX       31
#define ISP_CS_GAIN_THR_MAX     15

#define ISP_AF_GAMMA_PATTERN_MAX    7
#define ISP_AF_WIN_START_MAX        255
#define ISP_AF_WIN_END_MAX          255
#define ISP_AF_SUM_SHIFT_A_MAX        3
#define ISP_AF_SUM_SHIFT_B_MAX        7
#define ISP_AF_FCORE_MAX            15

typedef enum {
    ISP_DPC_OFF = 0,
    ISP_DPC_FLY
} ISP_DPC_MODE_TYPE;

#if 0
static const int ISP_LSC_COEF_LIMIT[LSC_COEF_NUM][2] =
{
    { -4194304, 4194303 },      // A
    { -4096, 4095 },            // B
    { 0, 255 },                 // C
    { -4194304, 4194303 },      // D
    { -4096, 4095 },            // E
    { -4194304, 4194303 },      // G
};
#endif

#define ISP_LSC_MAX_MAX  255
#define ISP_LSC_MAX_MIN  0


#define ISP_ERROR_ADDR 0xffffffff

/* For 16bits reg, high 8bits offset 1Byte is low 8bits */
#define ISP_REG_H_L_OFFSET 0X1

/* read 16 bits data consits of high 8bits and low 8bits */
#define BL_RD_16_H_L_REG(addr_h, addr_l) \
    ((BL_RD_BYTE(addr_h)) << 8) + (BL_RD_BYTE(addr_l))

#define ISP_RD_16_H_L_REG(regname_h, regname_l) \
    ((BL_RD_BYTE_REG(ISP_BASE, regname_h)) << 8) + (BL_RD_BYTE_REG(ISP_BASE, regname_l))


#define IS_BLACK_WHITE_MODE(mode)     (mode == BLACK_WHITE_MODE_ON)

typedef enum {
    ISP_HSYNC_INVERT_NORMAL = 0,
    ISP_HSYNC_INVERT_INVERT
}ISP_HSYNC_INVERT_TYPE;

