bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
typedef enum {
    ISP_VSYNC_INVERT_NORMAL = 0,
    ISP_VSYNC_INVERT_INVERT
}ISP_VSYNC_INVERT_TYPE;

typedef enum {
    ISP_HCNT_RST_RISING = 0,
    ISP_HCNT_RST_FALLING
}ISP_HCNT_RST_TYPE;

typedef enum {
    ISP_VCNT_RST_RISING = 0,
    ISP_VCNT_RST_FALLING
}ISP_VCNT_RST_TYPE;

typedef enum {
    ISP_VCNT_RST_REVERT_FALLING = 0,
    ISP_VCNT_RST_REVERT_RISING
}ISP_VCNT_RST_REVERT_TYPE;

typedef enum {
    ISP_HBLK_LINE_OFF = 0,
    ISP_HBLK_LINE_ON = 1,
}ISP_HBLK_LINE_TYPE;

typedef enum {
    ISP_FHBLK_LINE_OFF = 0,
    ISP_FHBLK_LINE_ON = 1,
}ISP_FHBLK_LINE_TYPE;


static void ISP_Print_TG(void)
{
#if 0
    isp_tg_reg_t *isp_tg_reg = (isp_tg_reg_t*)ISP_BASE;
    BL_LOGD("tot win: %dx%d\r\n", isp_tg_reg->total_pixels.BF.total_hpixels_w,
        isp_tg_reg->total_pixels.BF.total_vlines_w);
    BL_LOGD("act win: %dx%d, start (%d, %d)\r\n", isp_tg_reg->act_pixels_1.BF.act_pixel_width_w,
        isp_tg_reg->act_pixels_2.BF.act_line_height_w, isp_tg_reg->act_pixels_1.BF.act_start_pixel_w,
        isp_tg_reg->act_pixels_2.BF.act_start_line_w);
#endif
}

static uint16_t ISP_Calc_Total_Width(const ISP_TG_Cfg_Type *config)
{
    // uint32_t pix_clk = config->pix_clk;
    // uint32_t ISP_clk = config->ISP_clk;
    // uint16_t sns_tot_width = config->total_width;

    return (uint16_t)((uint64_t)config->ISP_clk/config->total_height/config->fps + 48) & 0xFFFE;
#if 0
#if (BL80X_HW_VER <= BL80X_HW_A0)
    if (pix_clk == 0)
        return sns_tot_width;

    /* TODO: workaround bayer issue and top garbage lines issue */
    if (sns_tot_width == 1600)
        return 0x716;   // bitfile: VCU118, update interrupt _d2b739ea86_23364bd51e

    /* OV9732 */
    if (sns_tot_width == 1478)
        return 0x6B6;

#if 0
    /* SC2232 */
    if (sns_tot_width == 2200)
        return 0xe14;
#endif

    /* SC2232 */
    if (sns_tot_width == 2080)
#if (BL80X_HW_VER <= BL80X_HW_A0)
        return 0x886;
#else
        return 0xDE80;
#endif
#endif
#endif
    /* the final total width must be even */

    // return (uint16_t)((uint64_t)ISP_clk/1125/25) & 0xFFFE;

    // return (uint16_t)((uint64_t)sns_tot_width * ISP_clk / pix_clk + 48) & 0xFFFE;    //TODO: remove magic number
}

static bool is_LSC_Coeff_Valid(const ISP_LSC_COEF_S *lsc)
{
    int i;
    for (i = 0; i < LSC_COEF_NUM; ++i) {
        CHECK_PARAM_RANGE(lsc->lsc_coef_r.coef[i], ISP_LSC_COEF_LIMIT[i][0], ISP_LSC_COEF_LIMIT[i][1]);
        CHECK_PARAM_RANGE(lsc->lsc_coef_g.coef[i], ISP_LSC_COEF_LIMIT[i][0], ISP_LSC_COEF_LIMIT[i][1]);
        CHECK_PARAM_RANGE(lsc->lsc_coef_b.coef[i], ISP_LSC_COEF_LIMIT[i][0], ISP_LSC_COEF_LIMIT[i][1]);
    }

    return true;
}

static bool is_LSC_Coeff_Type_Valid(const ISP_LSC_COEF_TYPE *lsc)
{
    int i;
    for (i = 0; i < LSC_COEF_NUM; ++i) {
        CHECK_PARAM_RANGE(lsc->coef[i], ISP_LSC_COEF_LIMIT[i][0], ISP_LSC_COEF_LIMIT[i][1]);
    }

    return true;
}

static int ISP_Calc_Clamp_Gain(int black_level)
{
    return DIV_ROUND(4095 * 4096, (4095 - black_level));
}

void ISP_Init(void)
{
    uint32_t tmpVal;

#if (BL80X_HW_VER <= BL80X_HW_A0)
    tmpVal = BL_RD_REG(ISP_BASE, ISP_FRONT_AE_COEFF);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_YSUM_COEFF_R_PRE, 77);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_YSUM_COEFF_G_PRE, 150);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_YSUM_COEFF_B_PRE, 29);
    BL_WR_REG(ISP_BASE, ISP_FRONT_AE_COEFF, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BACK_DNR_B);
    /* yuv output 16bit mode */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BACK_OUT_FORMAT_W, 1);
    /* YUYV order */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BACK_CBCR_SELECT_W, 1);
    /* 3DNR dram delay match, proposed by MingChun */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BACK_DELAYNUM3DNR_W, 4);
#else

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_COEFF);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_YSUM_COEFF_R_PRE, 77);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_YSUM_COEFF_G_PRE, 150);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_YSUM_COEFF_B_PRE, 29);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AE_COEFF, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_DNR_B);
    /* yuv output 16bit mode */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_OUT_FORMAT_W, 1);
    /* YUYV order */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CBCR_SELECT_W, 1);

    BL_WR_REG(ISP_BASE, ISP_BLBACK_DNR_B, tmpVal);
#endif
    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AWB_SETTING);
    tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE_BL_AWB_GAIN_SEL_W);
#if (BL80X_HW_VER >= BL80X_HW_B0)
    tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE_BL_DIGITAL_GAIN_SEL_W);
#endif
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AWB_SETTING, tmpVal);
}

void ISP_Get_IP_Info(int *version, int *ip_id)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_IP_INFO);
    *version = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_VERSION_R);
    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_IP_INFO);
    *ip_id = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_IP_ID_R);

}

void ISP_Set_TG_Reshape_Cfg()
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_HVCOUNT_CTRL);
    tmpVal = BL_SET_REG_BIT(tmpVal, ISP_TG_TG_CTRL_START_W);
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_TG_AUTO_HVSYNC_GEN_W);
    tmpVal = BL_SET_REG_BIT(tmpVal, ISP_TG_TG_CTRL_OSTART_W);
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_TG_AUTO_OHVSYNC_GEN_W);
    BL_WR_REG(ISP_BASE, ISP_TG_HVCOUNT_CTRL, tmpVal);
}

void ISP_Set_TG_Cfg(const ISP_TG_Cfg_Type *cfg)
{
    isp_tg_reg_t *isp_tg_reg = (isp_tg_reg_t*)ISP_BASE;

    uint16_t act_start_pixel = 0;
    uint16_t act_pixel_width = 0;
    uint16_t act_start_line  = 0;
    uint16_t act_line_height = 0;

    uint16_t out_pixel_width = 0;
    uint16_t out_line_height = 0;

    uint16_t out_start_pixel = 0;
    uint16_t out_start_line = 0;

    /* TODO: crop the best window */
    if (ISP_SYNC_MODE_INPUT_VBLANK_NO_TOGGLE == cfg->sync_mode_value) {
        act_start_pixel = 0;    /* hcount reset in rising edge, so H blanking is put after valid line */
        act_pixel_width = cfg->active_width;
        act_start_line  = 0;
        act_line_height = cfg->active_height;
    }
    else {
        act_start_pixel = cfg->total_width - cfg->active_width;
        act_pixel_width = cfg->active_width;
        act_start_line  = cfg->total_height - cfg->active_height;
        act_line_height = cfg->active_height;
    }

#ifdef COLOR_HDMI_480P25
    out_pixel_width = 720;
    out_line_height = 480;
#else
    out_pixel_width = cfg->out_width;
    out_line_height = cfg->out_height;
#endif

    out_start_pixel = (act_pixel_width - out_pixel_width)/2;
    out_start_line  = (act_line_height - out_line_height)/2;

