bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
#if (BL80X_HW_VER >= BL80X_HW_B0)
    /* further reduce frame latency by enabling act_vsync reset mode on vsync edge */
    isp_tg_reg->dvp_mode.BF.reg_act_vsync_rst_en_w = 1;
#endif

    /* set sync mode */
    isp_tg_reg->dvp_mode.BF.sync_mode_w = cfg->sync_mode_value;
    isp_tg_reg->dvp_mode.BF.hsync_in_inv_w = ISP_HSYNC_INVERT_NORMAL;
    /* dvp_tsrc would do vsync invert so vsync pulse is always active low */
    isp_tg_reg->dvp_mode.BF.vsync_in_inv_w = ISP_VSYNC_INVERT_NORMAL;
    isp_tg_reg->dvp_mode.BF.fhblk_line_on_w = ISP_FHBLK_LINE_OFF;

    /* note: if vsync invert, vcnt reset mode set 0, means falling
        else if vsync not invert,  vcont reset mode set 1, also means falling
        this value will not open to user now.
    */
    if (ISP_SYNC_MODE_INPUT_VBLANK_NO_TOGGLE == cfg->sync_mode_value) {
        /* hcnt reset in rising edge, so H blanking is put after valid line
            vcnt reset mode must be 0, to make sure vcnt is reset to 4095 instead of 0. */
        isp_tg_reg->dvp_mode.BF.hcnt_rst_mode_w = ISP_HCNT_RST_RISING;
        isp_tg_reg->dvp_mode.BF.vcnt_rst_mode_w = ISP_VCNT_RST_RISING;
    }
    else {
        isp_tg_reg->dvp_mode.BF.hcnt_rst_mode_w = ISP_HCNT_RST_FALLING;
        isp_tg_reg->dvp_mode.BF.vcnt_rst_mode_w = ISP_HCNT_RST_FALLING;
    }

    /* set total pixels and total lines */
    isp_tg_reg->total_pixels.BF.total_hpixels_w =
        ISP_Calc_Total_Width(cfg);

    isp_tg_reg->total_pixels.BF.total_vlines_w = cfg->total_height;;

    /* act start pixel, act pixel width */
    isp_tg_reg->act_pixels_1.BF.act_start_pixel_w = act_start_pixel;
    isp_tg_reg->act_pixels_1.BF.act_pixel_width_w = act_pixel_width;

    /* act start line, act line height */
    isp_tg_reg->act_pixels_2.BF.act_start_line_w = act_start_line;
    isp_tg_reg->act_pixels_2.BF.act_line_height_w = act_line_height;

    /* out start pixel, out pixel width */
    isp_tg_reg->fact_pixels_1.BF.fact_start_pixel_w = out_start_pixel;
    isp_tg_reg->fact_pixels_1.BF.fact_pixel_width_w = out_pixel_width;

    /* out start line, out line height*/
    isp_tg_reg->fact_pixels_2.BF.fact_start_line_w = out_start_line;

#if !ENCODE_1080P_SVGA
    isp_tg_reg->fact_pixels_2.BF.fact_line_height_w = out_line_height;
#else
    isp_tg_reg->fact_pixels_2.BF.fact_line_height_w = ENC_HEIGHT(out_line_height);
#endif

    ISP_Print_TG();
}

void ISP_Set_DVP_Mode_Cfg(ISP_DVP_MODE_CFG_T *cfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_DVP_MODE);
    if (cfg->fhblk_line_on == 1) tmpVal = BL_SET_REG_BIT(tmpVal, ISP_TG_FHBLK_LINE_ON_W);
    else tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_TG_FHBLK_LINE_ON_W);

    if (cfg->hblk_line_on == 1) tmpVal = BL_SET_REG_BIT(tmpVal, ISP_TG_HBLK_LINE_ON_W);
    else tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_TG_HBLK_LINE_ON_W);

    if (cfg->vcnt_rst_mode == 1) tmpVal = BL_SET_REG_BIT(tmpVal, ISP_TG_VCNT_RST_MODE_W);
    else tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_TG_VCNT_RST_MODE_W);

    if (cfg->hcnt_rst_mode == 1) tmpVal = BL_SET_REG_BIT(tmpVal, ISP_TG_HCNT_RST_MODE_W);
    else tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_TG_HCNT_RST_MODE_W);

    if (cfg->vsync_in_inv == 1) tmpVal = BL_SET_REG_BIT(tmpVal, ISP_TG_VSYNC_IN_INV_W);
    else tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_TG_VSYNC_IN_INV_W);

    if (cfg->hsync_in_inv == 1) tmpVal = BL_SET_REG_BIT(tmpVal, ISP_TG_HSYNC_IN_INV_W);
    else tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_TG_HSYNC_IN_INV_W);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_SYNC_MODE_W, cfg->sync_mode);

    if (cfg->reg_act_vsync_rst_en == 1) tmpVal = BL_SET_REG_BIT(tmpVal, ISP_TG_REG_ACT_VSYNC_RST_EN_W);
    else tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_TG_REG_ACT_VSYNC_RST_EN_W);

    BL_WR_REG(ISP_BASE, ISP_TG_DVP_MODE, tmpVal);

}

void ISP_Get_DVP_Mode_Cfg(ISP_DVP_MODE_CFG_T *cfg)
{
    isp_tg_reg_t *isp_tg_reg = (isp_tg_reg_t*)ISP_BASE;

    cfg->reg_act_vsync_rst_en = isp_tg_reg->dvp_mode.BF.reg_act_vsync_rst_en_w;
    cfg->sync_mode      = isp_tg_reg->dvp_mode.BF.sync_mode_w;
    cfg->hsync_in_inv   = isp_tg_reg->dvp_mode.BF.hsync_in_inv_w;
    cfg->vsync_in_inv   = isp_tg_reg->dvp_mode.BF.vsync_in_inv_w;
    cfg->hcnt_rst_mode  = isp_tg_reg->dvp_mode.BF.hcnt_rst_mode_w;
    cfg->vcnt_rst_mode  = isp_tg_reg->dvp_mode.BF.vcnt_rst_mode_w;
    cfg->hblk_line_on   = isp_tg_reg->dvp_mode.BF.hblk_line_on_w;
    cfg->fhblk_line_on  = isp_tg_reg->dvp_mode.BF.fhblk_line_on_w;

}

void ISP_Set_Total_Pixels(BL_Img_Size_T *out_win)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_TOTAL_PIXELS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_TOTAL_HPIXELS_W, out_win->width);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_TOTAL_VLINES_W, out_win->height);
    BL_WR_REG(ISP_BASE, ISP_TG_TOTAL_PIXELS, tmpVal);
}

void ISP_Get_Total_Pixels(BL_Img_Size_T *out_win)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_TOTAL_PIXELS);
    out_win->width = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_TOTAL_HPIXELS_W);
    out_win->height = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_TOTAL_VLINES_W);
}

void ISP_Set_Active_Pixels(int start_pixel, int start_line, BL_Img_Size_T *out_win)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_ACT_PIXELS_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_ACT_PIXEL_WIDTH_W, out_win->width);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_ACT_START_PIXEL_W, start_pixel);
    BL_WR_REG(ISP_BASE, ISP_TG_ACT_PIXELS_1, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_ACT_PIXELS_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_ACT_LINE_HEIGHT_W, out_win->height);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_ACT_START_LINE_W, start_line);
    BL_WR_REG(ISP_BASE, ISP_TG_ACT_PIXELS_2, tmpVal);
}

void ISP_Get_Active_Pixels(int *start_pixel, int *start_line, BL_Img_Size_T *out_win)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_ACT_PIXELS_1);
    out_win->width = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_ACT_PIXEL_WIDTH_W);
    *start_pixel = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_ACT_START_PIXEL_W);

