bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_ACT_PIXELS_2);
    out_win->height = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_ACT_LINE_HEIGHT_W);
    *start_line = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_ACT_START_LINE_W);
}

void ISP_Set_Output_Pixels(int start_pixel, int start_line, BL_Img_Size_T *out_win)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_FACT_PIXELS_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_FACT_PIXEL_WIDTH_W, out_win->width);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_FACT_START_PIXEL_W, start_pixel);
    BL_WR_REG(ISP_BASE, ISP_TG_FACT_PIXELS_1, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_FACT_PIXELS_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_FACT_LINE_HEIGHT_W, out_win->height);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_FACT_START_LINE_W, start_line);
    BL_WR_REG(ISP_BASE, ISP_TG_FACT_PIXELS_2, tmpVal);
}

void ISP_Get_Output_Pixels(int *start_pixel, int *start_line, BL_Img_Size_T *out_win)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_FACT_PIXELS_1);
    out_win->width = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_FACT_PIXEL_WIDTH_W);
    *start_pixel = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_FACT_START_PIXEL_W);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_FACT_PIXELS_2);
    out_win->height = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_FACT_LINE_HEIGHT_W);
    *start_line = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_FACT_START_LINE_W);
}

void ISP_Set_Hsync_Pixels(int start_pixel, int start_line, BL_Img_Size_T *out_win)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_HSYNC_PIXEL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_HSYNC_PIXEL_WIDTH_W, out_win->width);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_HSYNC_START_PIXEL_W, start_pixel);
    BL_WR_REG(ISP_BASE, ISP_TG_HSYNC_PIXEL, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_HSYNC_LINE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_HSYNC_LINE_HEIGHT_W, out_win->height);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_HSYNC_START_LINE_W, start_line);
    BL_WR_REG(ISP_BASE, ISP_TG_HSYNC_LINE, tmpVal);
}

void ISP_Get_Hsync_Pixels(int *start_pixel, int *start_line, BL_Img_Size_T *out_win)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_HSYNC_PIXEL);
    out_win->width = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_HSYNC_PIXEL_WIDTH_W);
    *start_pixel = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_HSYNC_START_PIXEL_W);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_HSYNC_LINE);
    out_win->height = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_HSYNC_LINE_HEIGHT_W);
    *start_line = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_HSYNC_START_LINE_W);
}

void ISP_Set_Vsync_Pixels(int start_pixel, int start_line, int end_pixel, int line_height)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_VSYNC_LINE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_VSYNC_LINE_HEIGHT_W, line_height);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_VSYNC_START_LINE_W, start_line);
    BL_WR_REG(ISP_BASE, ISP_TG_VSYNC_LINE, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_VSYNC_PIXEL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_VSYNC_END_PIXEL_W, end_pixel);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_VSYNC_START_PIXEL_W, start_pixel);
    BL_WR_REG(ISP_BASE, ISP_TG_VSYNC_PIXEL, tmpVal);
}

void ISP_Get_Vsync_Pixels(int *start_pixel, int *start_line, int *end_pixel, int *line_height)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_VSYNC_LINE);
    *line_height = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_VSYNC_LINE_HEIGHT_W);
    *start_line = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_VSYNC_START_LINE_W);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_VSYNC_PIXEL);
    *end_pixel = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_VSYNC_END_PIXEL_W);
    *start_pixel = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_VSYNC_START_PIXEL_W);
}

int ISP_Set_Output_Window(BL_Img_Size_T *out_win)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_FACT_PIXELS_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_FACT_PIXEL_WIDTH_W, out_win->width);
    BL_WR_REG(ISP_BASE, ISP_TG_FACT_PIXELS_1, tmpVal);
    
    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_FACT_PIXELS_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_TG_FACT_LINE_HEIGHT_W, out_win->height);
    BL_WR_REG(ISP_BASE, ISP_TG_FACT_PIXELS_2, tmpVal);

    return 0;
}

int ISP_Get_Output_Window(BL_Img_Size_T *out_win)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_FACT_PIXELS_1);
    out_win->width = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_FACT_PIXEL_WIDTH_W);
    tmpVal = BL_RD_REG(ISP_BASE, ISP_TG_FACT_PIXELS_2);
    out_win->height = BL_GET_REG_BITS_VAL(tmpVal, ISP_TG_FACT_LINE_HEIGHT_W);

    return 0;
}

void ISP_Set_Bayer_Pattern(const BAYER_PATTERN_E pattern)
{
    isp_front_reg_t *isp_front_reg = (isp_front_reg_t*)ISP_BASE;

    isp_front_reg->pattern_mode.BF.pattern_mode_w = 0;

#if (BL80X_HW_VER >= BL80X_HW_B0)
    /* fix issue: bayer pattern highly sensitive to total width setting */
    isp_front_reg->pattern_mode.BF.reg_bl_lpid_sel_w = 1;
#endif

    if (pattern == BAYER_PATTERN_BG) {
        /* lid invert depends on the total height */
        isp_front_reg->pattern_mode.BF.pid_inv_rgb_pre = 1;
        isp_front_reg->pattern_mode.BF.lid_inv_rgb_pre = 1;
    } else if (pattern == BAYER_PATTERN_RG) {
        isp_front_reg->pattern_mode.BF.pid_inv_rgb_pre = 0;
        isp_front_reg->pattern_mode.BF.lid_inv_rgb_pre = 0;
    } else if (pattern == BAYER_PATTERN_GR) {
        isp_front_reg->pattern_mode.BF.pid_inv_rgb_pre = 1;
        isp_front_reg->pattern_mode.BF.lid_inv_rgb_pre = 0;
    } else if (pattern == BAYER_PATTERN_GB) {
        isp_front_reg->pattern_mode.BF.pid_inv_rgb_pre = 0;
        isp_front_reg->pattern_mode.BF.lid_inv_rgb_pre = 1;
    } else {
        BL_LOGE("[error] error bayer pattern! \r\n");
        return;
    }
    /* hack for CISTA sensor */
    //isp_front_reg->pattern_mode.BF.pid_inv_rgb_pre = 1;
    //isp_front_reg->pattern_mode.BF.lid_inv_rgb_pre = 0;
}

void ISP_Get_Bayer_Pattern(BAYER_PATTERN_E *pattern)
{
    isp_front_reg_t *isp_front_reg = (isp_front_reg_t*)ISP_BASE;

    if ((isp_front_reg->pattern_mode.BF.pid_inv_rgb_pre == 1) &&
        (isp_front_reg->pattern_mode.BF.lid_inv_rgb_pre == 1)) {
        *pattern = BAYER_PATTERN_BG;
    } else if ((isp_front_reg->pattern_mode.BF.pid_inv_rgb_pre == 0) &&
        (isp_front_reg->pattern_mode.BF.lid_inv_rgb_pre == 0)) {
        *pattern = BAYER_PATTERN_RG;
    } else if ((isp_front_reg->pattern_mode.BF.pid_inv_rgb_pre == 1) &&
        (isp_front_reg->pattern_mode.BF.lid_inv_rgb_pre == 0)) {
        *pattern = BAYER_PATTERN_GR;
    } else if ((isp_front_reg->pattern_mode.BF.pid_inv_rgb_pre == 0) &&
        (isp_front_reg->pattern_mode.BF.lid_inv_rgb_pre == 1)) {
        *pattern = BAYER_PATTERN_GB;
    } else {
        BL_LOGE("[error] error bayer pattern! \r\n");
        return;
    }
}

void ISP_Set_BL444to422(int mode)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_DUMMY_CTRL);
    if (ENABLE == mode) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_REG_BL444TO422_EN_W, 1);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_REG_BL444TO422_EN_W, 0);
    }
    BL_WR_REG(ISP_BASE, ISP_BLBACK_DUMMY_CTRL, tmpVal);
}

void ISP_Get_BL444to422(int *mode)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_DUMMY_CTRL);
    *mode = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_REG_BL444TO422_EN_W);
}

