bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
void ISP_Set_AE_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE);

    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE_NEW_AE_STA_ENABLE_W);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MIDDLE_NEW_AE_STA_ENABLE_W);
    }

    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE, tmpVal);
}

void ISP_Set_AE_Stats_Conf(const isp_ae_stats_conf_t *ae_stats_conf)
{
    uint32_t tmpVal;

    CHECK_PARAM_MAX(ae_stats_conf->roi_start_x, ISP_AE_ROI_START_X_RANGE_MAX);
    CHECK_PARAM_MAX(ae_stats_conf->roi_start_y, ISP_AE_ROI_START_Y_RANGE_MAX);
    CHECK_PARAM_RANGE(ae_stats_conf->roi_width,
        ISP_AE_ROI_WIDTH_RANGE_MIN, ISP_AE_ROI_WIDTH_RANGE_MAX);
    CHECK_PARAM_RANGE(ae_stats_conf->roi_height,
        ISP_AE_ROI_HEIGHT_RANGE_MIN, ISP_AE_ROI_HEIGHT_RANGE_MAX);
    CHECK_PARAM_MIN(ae_stats_conf->grid_width, ISP_AE_GRID_WIDTH_RANGE_MIN);
    CHECK_PARAM_MIN(ae_stats_conf->grid_height, ISP_AE_GRID_HEIGHT_RANGE_MIN);
    CHECK_PARAM_RANGE(ae_stats_conf->grid_num_x,
        ISP_AE_GRID_NUM_X_RANGE_MIN, ISP_AE_GRID_NUM_X_RANGE_MAX);
    CHECK_PARAM_RANGE(ae_stats_conf->grid_num_y,
        ISP_AE_GRID_NUM_Y_RANGE_MIN, ISP_AE_GRID_NUM_Y_RANGE_MAX);

    /* special check */

    /* AE ROI must be in the active image region */
    if ((ae_stats_conf->roi_start_x + ae_stats_conf->roi_width > ae_stats_conf->img_width) ||
        (ae_stats_conf->roi_start_y + ae_stats_conf->roi_height > ae_stats_conf->img_height)) {
        BL_LOGE("AE ROI must be in the active image region!\r\n");
        BL_ABORT();
    }

    /* grid width/height must be even number */
    if ((ae_stats_conf->grid_width & 0x1) & (ae_stats_conf->grid_height & 0x1)) {
        BL_LOGE("Grid width/height must be even number!\r\n");
        BL_ABORT();
    }

#if (BL80X_HW_VER <= BL80X_HW_A0)
    tmpVal = BL_RD_REG(ISP_BASE, ISP_FRONT_AE_ROI_X);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_ROI_START_X_PRE, ae_stats_conf->roi_start_x);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_ROI_WIDTH_PRE, ae_stats_conf->roi_width);
    BL_WR_REG(ISP_BASE, ISP_FRONT_AE_ROI_X, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_FRONT_AE_ROI_Y);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_ROI_START_Y_PRE, ae_stats_conf->roi_start_y);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_ROI_HEIGHT_PRE, ae_stats_conf->roi_height);
    BL_WR_REG(ISP_BASE, ISP_FRONT_AE_ROI_Y, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_FRONT_AE_IMAGE_SIZE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_IMAGE_WIDTH_PRE, ae_stats_conf->img_width);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_IMAGE_HEIGHT_PRE, ae_stats_conf->img_height);
    BL_WR_REG(ISP_BASE, ISP_FRONT_AE_IMAGE_SIZE, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_FRONT_AE_GRID_SIZE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_GRID_WIDTH_PRE, ae_stats_conf->grid_width);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_GRID_HEIGHT_PRE, ae_stats_conf->grid_height);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_GRID_X_MAX_PRE, ae_stats_conf->grid_num_x);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_GRID_Y_MAX_PRE, ae_stats_conf->grid_num_y);
    tmpVal = BL_SET_REG_BIT(tmpVal, ISP_FRONT_NEW_AE_STA_ENABLE_W);
    /* AE occupies 1 bank of memory (doesn't switch for each image) */
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_FRONT_AE_SWITCH_BANK_EN_PRE);
    BL_WR_REG(ISP_BASE, ISP_FRONT_AE_GRID_SIZE, tmpVal);
#else
    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_ROI_X);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_ROI_START_X_PRE, ae_stats_conf->roi_start_x);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_ROI_WIDTH_PRE, ae_stats_conf->roi_width);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AE_ROI_X, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_ROI_Y);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_ROI_START_Y_PRE, ae_stats_conf->roi_start_y);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_ROI_HEIGHT_PRE, ae_stats_conf->roi_height);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AE_ROI_Y, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_IMAGE_SIZE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_IMAGE_WIDTH_PRE, ae_stats_conf->img_width);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_IMAGE_HEIGHT_PRE, ae_stats_conf->img_height);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AE_IMAGE_SIZE, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_GRID_WIDTH_PRE, ae_stats_conf->grid_width);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_GRID_HEIGHT_PRE, ae_stats_conf->grid_height);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_GRID_X_MAX_PRE, ae_stats_conf->grid_num_x);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_GRID_Y_MAX_PRE, ae_stats_conf->grid_num_y);
    tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE_NEW_AE_STA_ENABLE_W);
    /* AE occupies 2 bank of memory*/
    tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE_AE_SWITCH_BANK_EN_PRE);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE, tmpVal);
#endif
}

void ISP_Get_AE_Stats_Conf(isp_ae_stats_conf_t *ae_stats_conf)
{
    uint32_t tmpVal;

#if (BL80X_HW_VER <= BL80X_HW_A0)
    tmpVal = BL_RD_REG(ISP_BASE, ISP_FRONT_AE_ROI_X);
    ae_stats_conf->roi_start_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_ROI_START_X_PRE);
    ae_stats_conf->roi_width = BL_GET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_ROI_WIDTH_PRE);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_FRONT_AE_ROI_Y);
    ae_stats_conf->roi_start_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_ROI_START_Y_PRE);
    ae_stats_conf->roi_height = BL_GET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_ROI_HEIGHT_PRE);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_FRONT_AE_IMAGE_SIZE);
    ae_stats_conf->img_width = BL_GET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_IMAGE_WIDTH_PRE);
    ae_stats_conf->img_height = BL_GET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_IMAGE_HEIGHT_PRE);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_FRONT_AE_GRID_SIZE);
    ae_stats_conf->grid_width = BL_GET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_GRID_WIDTH_PRE);
    ae_stats_conf->grid_height = BL_GET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_GRID_HEIGHT_PRE);
    ae_stats_conf->grid_width = BL_GET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_GRID_X_MAX_PRE);
    ae_stats_conf->grid_height = BL_GET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_GRID_Y_MAX_PRE);
#else
    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_ROI_X);
    ae_stats_conf->roi_start_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_ROI_START_X_PRE);
    ae_stats_conf->roi_width = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_ROI_WIDTH_PRE);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_ROI_Y);
    ae_stats_conf->roi_start_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_ROI_START_Y_PRE);
    ae_stats_conf->roi_height = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_ROI_HEIGHT_PRE);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_IMAGE_SIZE);
    ae_stats_conf->img_width = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_IMAGE_WIDTH_PRE);
    ae_stats_conf->img_height = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_IMAGE_HEIGHT_PRE);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE);
    ae_stats_conf->grid_width = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_GRID_WIDTH_PRE);
    ae_stats_conf->grid_height = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_GRID_HEIGHT_PRE);
    ae_stats_conf->grid_width = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_GRID_X_MAX_PRE);
    ae_stats_conf->grid_height = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_GRID_Y_MAX_PRE);
#endif
}

void ISP_Set_AE_Ysum_Coeff(uint8_t coeff_r, uint8_t coeff_g, uint8_t coeff_b)
{
    uint32_t tmpVal;

