bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
#if (BL80X_HW_VER <= BL80X_HW_A0)
    tmpVal = BL_RD_REG(ISP_BASE, ISP_FRONT_AE_COEFF);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_YSUM_COEFF_R_PRE, coeff_r);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_YSUM_COEFF_G_PRE, coeff_g);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_YSUM_COEFF_B_PRE, coeff_b);
    BL_WR_REG(ISP_BASE, ISP_FRONT_AE_COEFF, tmpVal);
#else
    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_COEFF);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_YSUM_COEFF_R_PRE, coeff_r);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_YSUM_COEFF_G_PRE, coeff_g);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_YSUM_COEFF_B_PRE, coeff_b);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AE_COEFF, tmpVal);
#endif
}

void ISP_Get_AE_Ysum_Coeff(uint8_t *coeff_r, uint8_t *coeff_g, uint8_t *coeff_b)
{
    uint32_t tmpVal;

#if (BL80X_HW_VER <= BL80X_HW_A0)
    tmpVal = BL_RD_REG(ISP_BASE, ISP_FRONT_AE_COEFF);
    *coeff_r = BL_GET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_YSUM_COEFF_R_PRE);
    *coeff_g = BL_GET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_YSUM_COEFF_G_PRE);
    *coeff_b = BL_SET_REG_BITS_VAL(tmpVal, ISP_FRONT_AE_YSUM_COEFF_B_PRE);

#else
    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_COEFF);
    *coeff_r = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_YSUM_COEFF_R_PRE);
    *coeff_g = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_YSUM_COEFF_G_PRE);
    *coeff_b = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_YSUM_COEFF_B_PRE);

#endif
}

#if USE_AEAWB_SRAM
int ISP_Get_AE_Stats(int grid_num, uint32_t *data)
{
    uint32_t tmpVal;
    uint32_t buf_idx;
    uint32_t buf_addr;
    uint32_t w_cnt_idx_start;
    uint32_t w_cnt_idx_end;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_STATUS);
    buf_idx = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_BLAE_BUF_IDX_R);
    w_cnt_idx_start = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_BLAE_W_CNT_R);

    buf_addr = (0 == buf_idx) ? ISP_AE_SRAM_BANK1: ISP_AE_SRAM_BANK2;
    memcpy(data, (uint32_t*)buf_addr, grid_num*2); // two word per grid

    w_cnt_idx_end = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_BLAE_W_CNT_R);
    if (w_cnt_idx_start != w_cnt_idx_end) {
        BL_LOGW("ae statistics overwrite!");
        return -1;
    }

    return 0;
}

void ISP_Get_AE_Sum(int grid_idx, AE_GRID_DATA_TYPE_E data_type, uint32_t *data)
{
    isp_ae_sum_t *grid_array;
    uint32_t tmpVal;
    uint32_t buf_idx;
    uint32_t buf_addr;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_STATUS);
    buf_idx = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_BLAE_BUF_IDX_R);

    buf_addr = (0 == buf_idx) ? ISP_AE_SRAM_BANK1: ISP_AE_SRAM_BANK2;
    grid_array = (isp_ae_sum_t*)buf_addr;
    *data = grid_array[grid_idx].y_sum;
}
#else // not use USE_AEAWB_SRAM
void ISP_Get_AE_Sum(int grid_idx, AE_GRID_DATA_TYPE_E data_type, uint32_t *data)
{
    isp_blae_reg_t *isp_blae_reg = (isp_blae_reg_t*)ISP_BASE;
#if 0
    int grid_idx_offset = isp_blae_reg->blae_read_grid_addr.BF.blae_buf_idx ? (96 << 1) : 0;
#else
    int grid_idx_offset = 0;
#endif
    isp_blae_reg->blae_read_grid_addr.BF.blae_read_grid_addr = (grid_idx << 1) + data_type + grid_idx_offset;
    *data = isp_blae_reg->blae_grid_data.WORD;
}
#endif

void ISP_Set_AE_Hist_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE_AE_HIST_EN_PRE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MIDDLE_AE_HIST_EN_PRE);
    }
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE, tmpVal);
}

int  ISP_Get_AE_Hist_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE);

    if (BL_IS_REG_BIT_SET(tmpVal, ISP_MIDDLE_AE_HIST_EN_PRE)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }

    return 0;
}

void ISP_Set_AE_Hist_Mode(AE_HIST_MODE_TYPE_E mode)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE);
    if (AE_HIST_MODE_Y == mode) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE_AE_HIST_MODE_PRE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MIDDLE_AE_HIST_MODE_PRE);
    }
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE, tmpVal);
}

int  ISP_Get_AE_Hist_Mode(AE_HIST_MODE_TYPE_E *mode)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE);

    if (BL_IS_REG_BIT_SET(tmpVal, ISP_MIDDLE_AE_HIST_EN_PRE)) {
        *mode = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_HIST_MODE_PRE);
    } else {
        *mode = AE_HIST_MODE_Y;
    }

    return 0;
}

void ISP_Set_AE_Hist_ROI_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE_AE_HIST_ROI_EN_PRE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MIDDLE_AE_HIST_ROI_EN_PRE);
    }
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE, tmpVal);
}

int  ISP_Get_AE_Hist_ROI_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE);

    if (BL_IS_REG_BIT_SET(tmpVal, ISP_MIDDLE_AE_HIST_ROI_EN_PRE)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }

    return 0;
}

int  ISP_Set_AE_Hist_ROI(BL_Fun_Type state, const isp_ae_hist_roi_t *roi)
{
    uint32_t tmpVal;

    if (DISABLE == state) {
        tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE);
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MIDDLE_AE_HIST_ROI_EN_PRE);
        BL_WR_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE, tmpVal);
        return 0;
    }

    if (NULL == roi) {
        return -1;
    }

    CHECK_PARAM_MAX(roi->ae_hist_x_min, ISP_AE_HIST_ROI_MAX);
    CHECK_PARAM_MAX(roi->ae_hist_x_max, ISP_AE_HIST_ROI_MAX);
    CHECK_PARAM_MAX(roi->ae_hist_y_min, ISP_AE_HIST_ROI_MAX);
    CHECK_PARAM_MAX(roi->ae_hist_y_max, ISP_AE_HIST_ROI_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE2_ROI_X);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_HIST_X_MIN_PRE, roi->ae_hist_x_min);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_HIST_X_MAX_PRE, roi->ae_hist_x_max);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AE2_ROI_X, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE2_ROI_Y);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_HIST_Y_MIN_PRE, roi->ae_hist_y_min);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_HIST_Y_MAX_PRE, roi->ae_hist_y_max);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AE2_ROI_Y, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE);
    tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE_AE_HIST_ROI_EN_PRE);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE, tmpVal);

