bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
    return 0;
}

int  ISP_Get_AE_Hist_ROI(BL_Fun_Type state, isp_ae_hist_roi_t *roi)
{
    uint32_t tmpVal;

    if (DISABLE == state) {
        tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE);
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MIDDLE_AE_HIST_ROI_EN_PRE);
        BL_WR_REG(ISP_BASE, ISP_MIDDLE_AE_GRID_SIZE, tmpVal);
        return 0;
    }

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE2_ROI_X);
    roi->ae_hist_x_min = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_HIST_X_MIN_PRE);
    roi->ae_hist_x_max = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_HIST_X_MAX_PRE);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE2_ROI_Y);
    roi->ae_hist_y_min = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_HIST_Y_MIN_PRE);
    roi->ae_hist_y_max = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_HIST_Y_MAX_PRE);

    return 0;
}

int  ISP_Get_AE_Hist_SUM_Y(uint32_t *y_sum)
{
    uint32_t tmpVal;
    uint32_t w_cnt_idx_start;
    uint32_t w_cnt_idx_end;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_STATUS);
    w_cnt_idx_start = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_HIST_W_CNT_R);

    memcpy(y_sum, (uint32_t*)AE_HIST_SUM_ADDR_Y, ISP_AE_HIST_Y_BIN_NUM);

    w_cnt_idx_end = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_HIST_W_CNT_R);
    if (w_cnt_idx_start != w_cnt_idx_end) {
        BL_LOGW("ae hist y sum overwrite!");
        return -1;
    }

    return 0;
}

int  ISP_Get_AE_Hist_SUM_Bayer(uint32_t *r_sum, uint32_t *gr_sum, uint32_t *gb_sum, uint32_t *b_sum)
{
    uint32_t tmpVal;
    uint32_t w_cnt_idx_start;
    uint32_t w_cnt_idx_end;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AE_STATUS);
    w_cnt_idx_start = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_HIST_W_CNT_R);

    memcpy(r_sum,  (uint32_t*)AE_HIST_SUM_ADDR_R,  ISP_AE_HIST_BAYER_BIN_NUM);
    memcpy(gr_sum, (uint32_t*)AE_HIST_SUM_ADDR_GR, ISP_AE_HIST_BAYER_BIN_NUM);
    memcpy(gb_sum, (uint32_t*)AE_HIST_SUM_ADDR_GB, ISP_AE_HIST_BAYER_BIN_NUM);
    memcpy(b_sum,  (uint32_t*)AE_HIST_SUM_ADDR_B,  ISP_AE_HIST_BAYER_BIN_NUM);

    w_cnt_idx_end = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AE_HIST_W_CNT_R);
    if (w_cnt_idx_start != w_cnt_idx_end) {
        BL_LOGW("ae hist bayer sum overwrite!");
        return -1;
    }

    return 0;
}


void ISP_Set_AWB_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AWB_SETTING);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE_NEW_AWB_STA_ENABLE_W);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MIDDLE_NEW_AWB_STA_ENABLE_W);
    }

    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AWB_SETTING, tmpVal);
}

void ISP_Set_AWB_Stats_Conf(const isp_awb_stats_conf_t *awb_stats_conf)
{
    isp_middle_reg_t *isp_middle_reg = (isp_middle_reg_t*)ISP_BASE;

    CHECK_PARAM_MAX(awb_stats_conf->roi_start_x, ISP_AWB_ROI_START_X_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->roi_start_y, ISP_AWB_ROI_START_Y_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->roi_width, ISP_AWB_ROI_WIDTH_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->roi_height, ISP_AWB_ROI_HEIGHT_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->grid_num_x, ISP_AWB_GRID_NUM_X_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->grid_num_y, ISP_AWB_GRID_NUM_Y_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->r_max_thr, ISP_AWB_R_MAX_THR_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->r_min_thr, ISP_AWB_R_MIN_THR_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->g_max_thr, ISP_AWB_G_MAX_THR_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->g_min_thr, ISP_AWB_G_MIN_THR_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->b_max_thr, ISP_AWB_B_MAX_THR_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->b_min_thr, ISP_AWB_B_MIN_THR_RANGE_MAX);

    CHECK_PARAM_MIN(awb_stats_conf->grid_width, ISP_AWB_GRID_WIDTH_RANGE_MIN);
    CHECK_PARAM_MIN(awb_stats_conf->grid_height, ISP_AWB_GRID_HEIGHT_RANGE_MIN);

    /* special check */
    /* AWB ROI must be in the active image region */
    if ((awb_stats_conf->roi_start_x + awb_stats_conf->roi_width > awb_stats_conf->img_width) ||
        (awb_stats_conf->roi_start_y + awb_stats_conf->roi_height > awb_stats_conf->img_height)) {
        BL_LOGE("AWB ROI must be in the active image region!\r\n");
        BL_ABORT();
    }

    /* grid width/height must be even number */
    if ((awb_stats_conf->grid_width & 0x1) & (awb_stats_conf->grid_height & 0x1)) {
        BL_LOGE("Grid width/height must be even number!\r\n");
        BL_ABORT();
    }

    isp_middle_reg->awb_roi_x.BF.awb_roi_start_x_w = awb_stats_conf->roi_start_x;
    isp_middle_reg->awb_roi_x.BF.awb_roi_width_w = awb_stats_conf->roi_width;
    isp_middle_reg->awb_roi_y.BF.awb_roi_start_y_w = awb_stats_conf->roi_start_y;
    isp_middle_reg->awb_roi_y.BF.awb_roi_height_w = awb_stats_conf->roi_height;

    isp_middle_reg->awb_image_size.BF.awb_image_width_w = awb_stats_conf->img_width;
    isp_middle_reg->awb_image_size.BF.awb_image_height_w = awb_stats_conf->img_height;

    isp_middle_reg->awb_grid_size.BF.awb_grid_width_w = awb_stats_conf->grid_width;
    isp_middle_reg->awb_grid_size.BF.awb_grid_height_w = awb_stats_conf->grid_height;

    isp_middle_reg->awb_grid_size.BF.awb_grid_x_max_w = awb_stats_conf->grid_num_x;
    isp_middle_reg->awb_grid_size.BF.awb_grid_y_max_w = awb_stats_conf->grid_num_y;

    isp_middle_reg->awb_r_thre.BF.awb_r_max_thr_w = awb_stats_conf->r_max_thr;
    isp_middle_reg->awb_r_thre.BF.awb_r_min_thr_w = awb_stats_conf->r_min_thr;

    isp_middle_reg->awb_g_thre.BF.awb_g_max_thr_w = awb_stats_conf->g_max_thr;
    isp_middle_reg->awb_g_thre.BF.awb_g_min_thr_w = awb_stats_conf->g_min_thr;

    isp_middle_reg->awb_b_thre.BF.awb_b_max_thr_w = awb_stats_conf->b_max_thr;
    isp_middle_reg->awb_b_thre.BF.awb_b_min_thr_w = awb_stats_conf->b_min_thr;

    isp_middle_reg->awb_setting.BF.new_awb_sta_enable_w = 1;

    /* AWB occupies 2 banks of memory  */
    isp_middle_reg->awb_setting.BF.awb_switch_bank_en_w = 1;
}

void ISP_Get_AWB_Stats_Conf(isp_awb_stats_conf_t *awb_stats_conf)
{
    isp_middle_reg_t *isp_middle_reg = (isp_middle_reg_t*)ISP_BASE;

    awb_stats_conf->roi_start_x = isp_middle_reg->awb_roi_x.BF.awb_roi_start_x_w;
    awb_stats_conf->roi_start_y = isp_middle_reg->awb_roi_y.BF.awb_roi_start_y_w;
    awb_stats_conf->roi_width = isp_middle_reg->awb_roi_x.BF.awb_roi_width_w;
    awb_stats_conf->roi_height = isp_middle_reg->awb_roi_y.BF.awb_roi_height_w;
    awb_stats_conf->img_width = isp_middle_reg->awb_image_size.BF.awb_image_width_w;
    awb_stats_conf->img_height = isp_middle_reg->awb_image_size.BF.awb_image_height_w;

    awb_stats_conf->grid_width = isp_middle_reg->awb_grid_size.BF.awb_grid_width_w;
    awb_stats_conf->grid_height = isp_middle_reg->awb_grid_size.BF.awb_grid_height_w;
    awb_stats_conf->grid_num_x = isp_middle_reg->awb_grid_size.BF.awb_grid_x_max_w;
    awb_stats_conf->grid_num_y = isp_middle_reg->awb_grid_size.BF.awb_grid_y_max_w;

