bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
    awb_stats_conf->r_max_thr = isp_middle_reg->awb_r_thre.BF.awb_r_max_thr_w;
    awb_stats_conf->r_min_thr = isp_middle_reg->awb_r_thre.BF.awb_r_min_thr_w;
    awb_stats_conf->g_max_thr = isp_middle_reg->awb_g_thre.BF.awb_g_max_thr_w;
    awb_stats_conf->g_min_thr = isp_middle_reg->awb_g_thre.BF.awb_g_min_thr_w;
    awb_stats_conf->b_max_thr = isp_middle_reg->awb_b_thre.BF.awb_b_max_thr_w;
    awb_stats_conf->b_min_thr = isp_middle_reg->awb_b_thre.BF.awb_b_min_thr_w;
}

#if USE_AEAWB_SRAM

int ISP_Get_AWB_Stats(int grid_num, uint32_t *data)
{
    uint32_t tmpVal;
    uint32_t buf_idx;
    uint32_t buf_addr;
    uint32_t w_cnt_idx_start;
    uint32_t w_cnt_idx_end;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AWB_STA_DBG1);
    buf_idx = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_BLAWB_BUF_IDX_R);
    w_cnt_idx_start = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_BLAWB_W_CNT_R);

    buf_addr = (0 == buf_idx) ? ISP_AWB_SRAM_BANK1: ISP_AWB_SRAM_BANK2;
    memcpy(data, (uint32_t*)buf_addr, grid_num*2); // two word per grid

    w_cnt_idx_end = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_BLAWB_W_CNT_R);
    if (w_cnt_idx_start != w_cnt_idx_end) {
        BL_LOGW("awb statistics overwrite!");
        return -1;
    }

    return 0;
}

void ISP_Get_AWB_Sum(int grid_idx, RGB_SUM_S *rgb_sum)
{
    uint32_t tmpVal;
    uint32_t buf_idx;
    uint32_t buf_addr;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AWB_STA_DBG1);
    buf_idx = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_BLAWB_BUF_IDX_R);

    buf_addr = (0 == buf_idx) ? ISP_AWB_SRAM_BANK1: ISP_AWB_SRAM_BANK2;

    // isp_middle_reg_t *isp_middle_reg = (isp_middle_reg_t*)ISP_BASE;
    isp_awb_sum_t *grid_array = (isp_awb_sum_t*)buf_addr;

    rgb_sum->r_sum = grid_array[grid_idx].r_sum;
    rgb_sum->g_sum = grid_array[grid_idx].g_sum;
    rgb_sum->b_sum = grid_array[grid_idx].b_sum;

    // *buf_idx = isp_middle_reg->awb_sta_dbg1.BF.blawb_buf_idx_r;
}
#else
void ISP_Get_AWB_Sum(int grid_idx, RGB_SUM_S *rgb_sum, int *buf_idx)
{
    uint32_t grid_data;
    isp_blawb_reg_t *isp_blawb_reg = (isp_blawb_reg_t*)ISP_BASE;
    *buf_idx = 0;//isp_blawb_reg->blawb_read_grid_addr.BF.blawb_buf_idx;

    /* get R/G sum of the grid */
    isp_blawb_reg->blawb_read_grid_addr.BF.blawb_read_grid_addr =
        (grid_idx << 1) + (*buf_idx ? (1024 << 1) : 0);
    grid_data = isp_blawb_reg->blawb_grid_data.WORD;

    rgb_sum->r_sum = DIV_0_TO_1(grid_data & 0xFFF);
    rgb_sum->g_sum = DIV_0_TO_1((grid_data >> 16) & 0xFFF);

    /* get B sum of the grid */
    isp_blawb_reg->blawb_read_grid_addr.BF.blawb_read_grid_addr =
        (grid_idx << 1) + 1 + (*buf_idx ? (1024 << 1) : 0);
    grid_data = isp_blawb_reg->blawb_grid_data.WORD;

    rgb_sum->b_sum = DIV_0_TO_1(grid_data & 0xFFF);
}
#endif

void ISP_Get_AWB_ValidGridNum(int *valid_grid_num)
{
    isp_middle_reg_t *isp_middle_reg = (isp_middle_reg_t*)ISP_BASE;

    *valid_grid_num = isp_middle_reg->awb_setting.BF.grid_cnt_within_thre_r;
}

void ISP_Set_AWB_Gain(const ISP_RGB_Gain_Type *rgb_gain)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AWB_RGR_GAIN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AWB_R_GAIN_PRE, rgb_gain->r_gain);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AWB_GR_GAIN_PRE, rgb_gain->g_gain);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AWB_RGR_GAIN, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AWB_BGB_GAIN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AWB_B_GAIN_PRE, rgb_gain->b_gain);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AWB_GB_GAIN_PRE, rgb_gain->g_gain);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AWB_BGB_GAIN, tmpVal);
}

void ISP_Get_AWB_Gain(ISP_RGB_Gain_Type *rgb_gain)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AWB_RGR_GAIN);

    rgb_gain->r_gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AWB_R_GAIN_PRE);
    rgb_gain->g_gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AWB_GR_GAIN_PRE);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AWB_BGB_GAIN);
    rgb_gain->b_gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AWB_B_GAIN_PRE);
}

void ISP_Set_AWB_Offset(const ISP_RGB_Offset_Type *Offset)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AWB_RGR_OFFSET);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AWB_R_OFFSET_PRE, Offset->r_offset);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AWB_GR_OFFSET_PRE, Offset->g_offset);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AWB_RGR_OFFSET, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AWB_BGB_OFFSET);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AWB_B_OFFSET_PRE, Offset->b_offset);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AWB_GB_OFFSET_PRE, Offset->g_offset);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_AWB_BGB_OFFSET, tmpVal);
}

void ISP_Get_AWB_Offset(ISP_RGB_Offset_Type *Offset)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AWB_RGR_OFFSET);

    Offset->r_offset = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AWB_R_OFFSET_PRE);
    Offset->g_offset = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AWB_GR_OFFSET_PRE);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_AWB_BGB_OFFSET);
    Offset->b_offset = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_AWB_B_OFFSET_PRE);
}

void ISP_Set_AWB2_Stats_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_INT);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE3_AWB2_STAT_EN_PRE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MIDDLE3_AWB2_STAT_EN_PRE);
    }

    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_INT, tmpVal);
}

void ISP_Set_AWB2_Gain_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_INT);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE3_AWB2_GAIN_EN_PRE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MIDDLE3_AWB2_GAIN_EN_PRE);
    }

    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_INT, tmpVal);
}

int ISP_Get_AWB2_Sum(isp_awb2_sum_t *sum)
{
    uint32_t tmpVal;
    uint64_t tmpVal64;
    uint32_t buf_idx;
    uint32_t w_cnt_idx_start;
    uint32_t w_cnt_idx_end;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_INT);
    buf_idx = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_BUF_IDX_R);
    w_cnt_idx_start = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_W_CNT_R);

    if (0 == buf_idx) {
        sum->r_avg = BL_GET_REG_BITS_VAL(BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R0), ISP_MIDDLE3_AWB2_R_AVG0_R);
        sum->g_avg = BL_GET_REG_BITS_VAL(BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R0), ISP_MIDDLE3_AWB2_G_AVG0_R);
        sum->b_avg = BL_GET_REG_BITS_VAL(BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R1), ISP_MIDDLE3_AWB2_B_AVG0_R);
        sum->white_ratio = BL_GET_REG_BITS_VAL(BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R1), ISP_MIDDLE3_AWB2_WHITE_RATIO0_R);

        tmpVal64 = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R4);
        tmpVal   = BL_GET_REG_BITS_VAL(BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R5), ISP_MIDDLE3_AWB2_WHITER_SUML0_R);
        sum->white_r_sum = (tmpVal64 << 9) + tmpVal;

