bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
        tmpVal64 = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R7);
        tmpVal   = BL_GET_REG_BITS_VAL(BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R8), ISP_MIDDLE3_AWB2_WHITEG_SUML0_R);
        sum->white_g_sum = (tmpVal64 << 9) + tmpVal;

        tmpVal64 = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_RA);
        tmpVal   = BL_GET_REG_BITS_VAL(BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_RB), ISP_MIDDLE3_AWB2_WHITEB_SUML0_R);
        sum->white_b_sum = (tmpVal64 << 9) + tmpVal;
    }
    else {
        sum->r_avg = BL_GET_REG_BITS_VAL(BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R2), ISP_MIDDLE3_AWB2_R_AVG1_R);
        sum->g_avg = BL_GET_REG_BITS_VAL(BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R2), ISP_MIDDLE3_AWB2_G_AVG1_R);
        sum->b_avg = BL_GET_REG_BITS_VAL(BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R3), ISP_MIDDLE3_AWB2_B_AVG1_R);
        sum->white_ratio = BL_GET_REG_BITS_VAL(BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R3), ISP_MIDDLE3_AWB2_WHITE_RATIO1_R);

         tmpVal64 = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R6);
         tmpVal   = BL_GET_REG_BITS_VAL(BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R5), ISP_MIDDLE3_AWB2_WHITER_SUML1_R);
         sum->white_r_sum = (tmpVal64 << 9) + tmpVal;

         tmpVal64 = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R9);
         tmpVal   = BL_GET_REG_BITS_VAL(BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_R8), ISP_MIDDLE3_AWB2_WHITEG_SUML1_R);
         sum->white_g_sum = (tmpVal64 << 9) + tmpVal;

         tmpVal64 = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_RC);
         tmpVal   = BL_GET_REG_BITS_VAL(BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_RB), ISP_MIDDLE3_AWB2_WHITEB_SUML1_R);
         sum->white_b_sum = (tmpVal64 << 9) + tmpVal;
    }

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_INT);
    w_cnt_idx_end = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_W_CNT_R);

    // TODO: chang the algo
    if (w_cnt_idx_start != w_cnt_idx_end) {
        // BL_LOGW("w_cnt_idx_start %d, w_cnt_idx_end %d \r\n", w_cnt_idx_start, w_cnt_idx_end);
        // BL_LOGW("awb2 statistics overwrite!");
        return -1;
    }

    return 0;
}

void ISP_Set_AWB2_Gain(const ISP_RGB_Gain_Type *rgb_gain)
{
    ISP_Set_AWB_Gain(rgb_gain);
    // uint32_t tmpVal;

    // tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_GAIN1);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_RGAIN_PRE, rgb_gain->r_gain);
    // BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_GAIN1, tmpVal);

    // tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_GAIN2);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_GGAIN_PRE, rgb_gain->g_gain);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_BGAIN_PRE, rgb_gain->b_gain);
    // BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_GAIN2, tmpVal);
}

void ISP_Get_AWB2_Gain(ISP_RGB_Gain_Type *rgb_gain)
{
    ISP_Get_AWB_Gain(rgb_gain);
    // uint32_t tmpVal;

    // tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_GAIN1);
    // rgb_gain->r_gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_RGAIN_PRE);

    // tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_GAIN2);
    // rgb_gain->g_gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_GGAIN_PRE);
    // rgb_gain->b_gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_BGAIN_PRE);
}

void ISP_Set_AWB2_Stats_Conf(const isp_awb2_stats_conf_t *awb_stats_conf)
{
    uint32_t tmpVal;

    CHECK_PARAM_MAX(awb_stats_conf->stat_x_min, ISP_AWB_ROI_START_X_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->stat_x_max, ISP_AWB_ROI_START_X_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->stat_y_min, ISP_AWB_ROI_START_Y_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->stat_y_max, ISP_AWB_ROI_START_Y_RANGE_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_XAXIS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_X_MIN_PRE, awb_stats_conf->stat_x_min);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_X_MAX_PRE, awb_stats_conf->stat_x_max);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_XAXIS, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_YAXIS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_Y_MIN_PRE, awb_stats_conf->stat_y_min);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_Y_MAX_PRE, awb_stats_conf->stat_y_max);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_YAXIS, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_PIXEL_NUM);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_PIXEL_NUM_PRE, awb_stats_conf->stat_pixel_num);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_PIXEL_NUM, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_GAIN0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_STAT_GGAIN_PRE, awb_stats_conf->stat_g_gain);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_STAT_RGAIN_PRE, awb_stats_conf->stat_r_gain);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_GAIN0, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_GAIN1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_STAT_BGAIN_PRE, awb_stats_conf->stat_b_gain);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_GAIN1, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_GAIN3);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_VGAIN_PRE, awb_stats_conf->stat_v_gain);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_UGAIN_PRE, awb_stats_conf->stat_u_gain);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_GAIN3, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_L0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_YTH1_PRE, awb_stats_conf->y_th[1]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_YTH2_PRE, awb_stats_conf->y_th[2]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_YTH3_PRE, awb_stats_conf->y_th[3]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_YTH4_PRE, awb_stats_conf->y_th[4]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_L0, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_L1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_YTH0_PRE, awb_stats_conf->y_th[0]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_YWEIGHT2_PRE, awb_stats_conf->y_weight[2]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_YWEIGHT3_PRE, awb_stats_conf->y_weight[3]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_YWEIGHT4_PRE, awb_stats_conf->y_weight[4]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_L1, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_L2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_YWEIGHT0_PRE, awb_stats_conf->y_weight[0]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_YWEIGHT1_PRE, awb_stats_conf->y_weight[1]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_YSLOPE4_PRE, awb_stats_conf->y_slope[4]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_L2, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_L3);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_YSLOPE3_PRE, awb_stats_conf->y_slope[3]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_YSLOPE2_PRE, awb_stats_conf->y_slope[2]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_L3, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_L4);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_YSLOPE1_PRE, awb_stats_conf->y_slope[1]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_YSLOPE0_PRE, awb_stats_conf->y_slope[0]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_L4, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C0);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_UREG4_PRE, awb_stats_conf->u[4]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_UREG5_PRE, awb_stats_conf->u[5]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_UREG6_PRE, awb_stats_conf->u[6]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_UREG7_PRE, awb_stats_conf->u[7]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C0, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C1);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_UREG0_PRE, awb_stats_conf->u[0]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_UREG1_PRE, awb_stats_conf->u[1]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_UREG2_PRE, awb_stats_conf->u[2]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_UREG3_PRE, awb_stats_conf->u[3]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C1, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C2);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_VREG4_PRE, awb_stats_conf->v[4]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_VREG5_PRE, awb_stats_conf->v[5]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_VREG6_PRE, awb_stats_conf->v[6]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_VREG7_PRE, awb_stats_conf->v[7]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C2, tmpVal);

