bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C3);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_UREG0_PRE, awb_stats_conf->v[0]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_UREG1_PRE, awb_stats_conf->v[1]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_UREG2_PRE, awb_stats_conf->v[2]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE3_AWB2_UREG3_PRE, awb_stats_conf->v[3]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C3, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C4);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CTH4_PRE, awb_stats_conf->c_th[4]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CTH5_PRE, awb_stats_conf->c_th[5]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CTH6_PRE, awb_stats_conf->c_th[6]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CTH7_PRE, awb_stats_conf->c_th[7]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C4, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C5);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CTH0_PRE, awb_stats_conf->c_th[0]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CTH1_PRE, awb_stats_conf->c_th[1]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CTH2_PRE, awb_stats_conf->c_th[2]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CTH3_PRE, awb_stats_conf->c_th[3]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C5, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C6);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CSLOPE4_PRE, awb_stats_conf->c_slope[4]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CSLOPE5_PRE, awb_stats_conf->c_slope[5]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CSLOPE6_PRE, awb_stats_conf->c_slope[6]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CSLOPE7_PRE, awb_stats_conf->c_slope[7]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C6, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C7);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CSLOPE0_PRE, awb_stats_conf->c_slope[0]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CSLOPE1_PRE, awb_stats_conf->c_slope[1]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CSLOPE2_PRE, awb_stats_conf->c_slope[2]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE3_AWB2_CSLOPE3_PRE, awb_stats_conf->c_slope[3]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE3_AWB2_STA_C7, tmpVal);
}

void ISP_Set_AWB3_Hist_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_0);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE5_AWB3_STAT_EN_PRE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MIDDLE5_AWB3_STAT_EN_PRE);
    }

    BL_WR_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_0, tmpVal);
}

void ISP_Get_AWB3_Hist_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_0);
    if (BL_IS_REG_BIT_SET(tmpVal, ISP_MIDDLE5_AWB3_STAT_EN_PRE)){
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}

void ISP_Set_AWB3_Stats_Conf(const isp_awb3_stats_conf_t *awb_stats_conf)
{
    uint32_t tmpVal;

    CHECK_PARAM_MAX(awb_stats_conf->stat_x_min, ISP_AWB_ROI_START_X_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->stat_x_max, ISP_AWB_ROI_START_X_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->stat_y_min, ISP_AWB_ROI_START_Y_RANGE_MAX);
    CHECK_PARAM_MAX(awb_stats_conf->stat_y_max, ISP_AWB_ROI_START_Y_RANGE_MAX);

    // awb window
    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_STAT_X_MIN_PRE, awb_stats_conf->stat_x_min);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_STAT_X_MAX_PRE, awb_stats_conf->stat_x_max);
    BL_WR_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_0, tmpVal);

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_STAT_Y_MIN_PRE, awb_stats_conf->stat_y_min);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_STAT_Y_MAX_PRE, awb_stats_conf->stat_y_max);
    BL_WR_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_1, tmpVal);

    // weight_ratio
    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_4);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_WT_RATIO_EN_PRE, awb_stats_conf->weight_ratio_en);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_WT_RATIO_GAIN_PRE, awb_stats_conf->weight_ratio_gain);
    BL_WR_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_4, tmpVal);

    // y coeff
    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_26);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_Y_R_COEFF_PRE, awb_stats_conf->y_r_coeff);
    BL_WR_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_26, tmpVal);

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_27);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_Y_G_COEFF_PRE, awb_stats_conf->y_g_coeff);
    BL_WR_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_27, tmpVal);

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_28);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_Y_B_COEFF_PRE, awb_stats_conf->y_b_coeff);
    BL_WR_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_28, tmpVal);

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_29);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_WT_Y_USE_G_PRE, awb_stats_conf->weight_y_use_g);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_WT_Y_EN_PRE, awb_stats_conf->weight_y_en);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_WT_Y_GAIN_PRE, awb_stats_conf->weight_y_gain);
    BL_WR_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_29, tmpVal);

    memcpy((uint32_t*)(ISP_AWB3_BASE + ISP_MIDDLE5_AWB3_CONFIG_30_OFFSET), \
        (uint32_t*)&(awb_stats_conf->weight_y[0][0]), 21);


    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_51);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_COUNT_ZERO_WT_PRE,   awb_stats_conf->count_zero_weight);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_HIST_Y_USE_G_PRE,    awb_stats_conf->hist_y_use_g);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_BIN_Y_LEVEL_PRE,     awb_stats_conf->bin_y_level);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_BIN_RATIO_LEVEL_PRE, awb_stats_conf->bin_ratio_level);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_BIN_CLIP_EN_PRE,     awb_stats_conf->bin_clip_en);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_BIN_PIXEL_CLIP_PRE,  awb_stats_conf->bin_pixel_clip);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_BIN_MODE_PRE,        awb_stats_conf->bin_mode);
    BL_WR_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_51, tmpVal);

