bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_52);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_INK_TYPE_PRE, awb_stats_conf->ink_type);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_INK_GAIN_PRE, awb_stats_conf->ink_gain);
    BL_WR_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_52, tmpVal);

    // calibration
    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_G_DIVISOR_PRE,    awb_stats_conf->g_divisor);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_R_RATIO_OFST_PRE, awb_stats_conf->r_ratio_ofst);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_B_RATIO_OFST_PRE, awb_stats_conf->b_ratio_ofst);
    BL_WR_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_2, tmpVal);


    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_3);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_R_RATIO_MULT_PRE, awb_stats_conf->r_ratio_mult);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_B_RATIO_MULT_PRE, awb_stats_conf->b_ratio_mult);
    BL_WR_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_3, tmpVal);

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_4);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_RATIO_SUM_MIN_PRE, awb_stats_conf->ratio_sum_min);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_RATIO_SUM_MAX_PRE, awb_stats_conf->ratio_sum_max);
    BL_WR_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_4, tmpVal);

    memcpy((uint32_t*)(ISP_AWB3_BASE + ISP_MIDDLE5_AWB3_CONFIG_5_OFFSET), \
        (uint32_t*)&(awb_stats_conf->weight_ratio[0][0]), 21);
}

void ISP_Get_AWB3_Stats_Conf(isp_awb3_stats_conf_t *awb_stats_conf)
{
    uint32_t tmpVal;

    // awb window
    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_0);
    awb_stats_conf->stat_x_min = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_STAT_X_MIN_PRE);
    awb_stats_conf->stat_x_max = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_STAT_X_MAX_PRE);

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_1);
    awb_stats_conf->stat_y_min = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_STAT_Y_MIN_PRE);
    awb_stats_conf->stat_y_max = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_STAT_Y_MAX_PRE);

    // weight_ratio
    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_4);
    awb_stats_conf->weight_ratio_en = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_WT_RATIO_EN_PRE);
    awb_stats_conf->weight_ratio_gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_WT_RATIO_GAIN_PRE);

    // y coeff
    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_26);
    awb_stats_conf->y_r_coeff = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_Y_R_COEFF_PRE);

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_27);
    awb_stats_conf->y_g_coeff = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_Y_G_COEFF_PRE);

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_28);
    awb_stats_conf->y_b_coeff = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_Y_B_COEFF_PRE);

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_29);
    awb_stats_conf->weight_y_use_g = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_WT_Y_USE_G_PRE);
    awb_stats_conf->weight_y_en = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_WT_Y_EN_PRE);
    awb_stats_conf->weight_y_gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_WT_Y_GAIN_PRE);

    memcpy((uint32_t*)&(awb_stats_conf->weight_y[0][0]), \
        (uint32_t*)(ISP_AWB3_BASE + ISP_MIDDLE5_AWB3_CONFIG_30_OFFSET), 21);

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_51);
    awb_stats_conf->count_zero_weight = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_COUNT_ZERO_WT_PRE);
    awb_stats_conf->hist_y_use_g = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_HIST_Y_USE_G_PRE);
    awb_stats_conf->bin_y_level = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_BIN_Y_LEVEL_PRE);
    awb_stats_conf->bin_ratio_level = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_BIN_RATIO_LEVEL_PRE);
    awb_stats_conf->bin_clip_en = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_BIN_CLIP_EN_PRE);
    awb_stats_conf->bin_pixel_clip = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_BIN_PIXEL_CLIP_PRE);
    awb_stats_conf->bin_mode = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_BIN_MODE_PRE);

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_52);
    awb_stats_conf->ink_type = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_INK_TYPE_PRE);
    awb_stats_conf->ink_gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_INK_GAIN_PRE);

    // calibration
    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_2);
    awb_stats_conf->g_divisor = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_G_DIVISOR_PRE);
    awb_stats_conf->r_ratio_ofst = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_R_RATIO_OFST_PRE);
    awb_stats_conf->b_ratio_ofst = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_B_RATIO_OFST_PRE);

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_3);
    awb_stats_conf->r_ratio_mult = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_R_RATIO_MULT_PRE);
    awb_stats_conf->b_ratio_mult = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_B_RATIO_MULT_PRE);

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_4);
    awb_stats_conf->ratio_sum_min = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_RATIO_SUM_MIN_PRE);
    awb_stats_conf->ratio_sum_max = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_RATIO_SUM_MAX_PRE);

    memcpy((uint32_t*)&(awb_stats_conf->weight_ratio[0][0]), \
        (uint32_t*)(ISP_AWB3_BASE + ISP_MIDDLE5_AWB3_CONFIG_5_OFFSET), 21);
}

int ISP_Get_AWB3_Sum(isp_awb3_sum_t *sum)
{
    uint32_t tmpVal;
    uint64_t tmpVal64;
    uint32_t buf_idx;
    uint32_t w_cnt_idx_start;
    uint32_t w_cnt_idx_end;

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STATUS_0);
    buf_idx = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_BUF_IDX_R);
    w_cnt_idx_start = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_W_CNT_R);

    if (0 == buf_idx) {
        sum->r_sum = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_0);
        sum->g_sum = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_1);
        sum->b_sum = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_2);

