bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
        sum->r_sum_hex = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_3);
        sum->g_sum_hex = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_4);
        sum->b_sum_hex = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_5);

        sum->pixel_hex = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_6);

        tmpVal64 = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_7);
        tmpVal   = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_8);
        sum->r_ratio_hex_y = (tmpVal64 << 32) + tmpVal;

        tmpVal64 = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_9);
        tmpVal   = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_10);
        sum->b_ratio_hex_y = (tmpVal64 << 32) + tmpVal;

        sum->weight_hex_y = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_11);
        sum->pixel_hex_y  = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_12);

        tmpVal64 = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_13);
        tmpVal   = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_14);
        sum->r_ratio_hist = (tmpVal64 << 32) + tmpVal;

        tmpVal64 = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_15);
        tmpVal   = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_16);
        sum->b_ratio_hist = (tmpVal64 << 32) + tmpVal;

        sum->weight_hist = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_17);
        sum->pixel_hist  = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_18);

        tmpVal64 = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_19);
        tmpVal   = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_20);
        sum->r_ratio_hist_clip = (tmpVal64 << 32) + tmpVal;

        tmpVal64 = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_21);
        tmpVal   = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_22);
        sum->b_ratio_hist_clip = (tmpVal64 << 32) + tmpVal;

        sum->weight_hist_clip = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_23);
        sum->pixel_hist_clip  = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_24);
    }
    else {
        sum->r_sum = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_25);
        sum->g_sum = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_26);
        sum->b_sum = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_27);

        sum->r_sum_hex = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_28);
        sum->g_sum_hex = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_29);
        sum->b_sum_hex = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_30);

        sum->pixel_hex = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_31);

        tmpVal64 = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_32);
        tmpVal   = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_33);
        sum->r_ratio_hex_y = (tmpVal64 << 32) + tmpVal;

        tmpVal64 = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_34);
        tmpVal   = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_35);
        sum->b_ratio_hex_y = (tmpVal64 << 32) + tmpVal;

        sum->weight_hex_y = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_36);
        sum->pixel_hex_y  = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_37);

        tmpVal64 = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_38);
        tmpVal   = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_39);
        sum->r_ratio_hist = (tmpVal64 << 32) + tmpVal;

        tmpVal64 = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_40);
        tmpVal   = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_41);
        sum->b_ratio_hist = (tmpVal64 << 32) + tmpVal;

        sum->weight_hist = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_42);
        sum->pixel_hist  = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_43);

        tmpVal64 = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_44);
        tmpVal   = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_45);
        sum->r_ratio_hist_clip = (tmpVal64 << 32) + tmpVal;

        tmpVal64 = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_46);
        tmpVal   = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_47);
        sum->b_ratio_hist_clip = (tmpVal64 << 32) + tmpVal;

        sum->weight_hist_clip = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_48);
        sum->pixel_hist_clip  = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STA_49);
    }

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_STATUS_0);
    w_cnt_idx_end = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_W_CNT_R);

    if (w_cnt_idx_start != w_cnt_idx_end) {
        // BL_LOGW("w_cnt_idx_start %d, w_cnt_idx_end %d \r\n", w_cnt_idx_start, w_cnt_idx_end);
        // BL_LOGW("awb3 statistics overwrite!");
        return -1;
    }

    return 0;
}

int ISP_Get_AWB3_Hist_Bin_Num(uint32_t *num)
{
    uint32_t tmpVal;
    uint32_t bin_y_level;
    uint32_t bin_ratio_level;
    isp_awb3_bin_mode_e mode;

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_51);
    bin_y_level = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_BIN_Y_LEVEL_PRE);
    bin_ratio_level = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_BIN_RATIO_LEVEL_PRE);

    ISP_Get_AWB3_Bin_Mode(&mode);
    if (mode == AWB3_BIN_MODE_FULL) {
        *num = 1 << (bin_y_level + bin_ratio_level*2);
    } else if (mode == AWB3_BIN_MODE_RATIO) {
        *num = 1 << (bin_ratio_level*2);
    } else if (mode == AWB3_BIN_MODE_Y) {
        *num = 1 << (bin_y_level);
    } else {//AWB3_BIN_MODE_NONE
        *num = 0;
    }

    return 0;
}

int ISP_Get_AWB3_Bin_Mode(isp_awb3_bin_mode_e *mode)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_51);
    *mode = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_BIN_MODE_PRE);

    return 0;
}

void ISP_Set_AWB3_Bin_Mode(isp_awb3_bin_mode_e mode)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_51);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_BIN_MODE_PRE, mode);
    BL_WR_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_51, tmpVal);
}

int ISP_Get_AWB3_Hist(uint32_t *data)
{
    uint32_t bucket_num;

    ISP_Get_AWB3_Hist_Bin_Num(&bucket_num);
    CHECK_PARAM_RANGE(bucket_num, AWB3_HIST_BUCKET_NUM_MIN, AWB3_HIST_BUCKET_NUM_MAX);

    memcpy(data, (uint32_t*)AWB3_HIST_BUCKET_ADDR, sizeof(isp_awb3_bucket_t)*bucket_num);

