bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
    return 0;
}

int ISP_Get_AWB3_G_Divisor(int *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_2);
    *value = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_G_DIVISOR_PRE);

    return 0;
}

void ISP_Set_AWB3_G_Divisor(int value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE5_AWB3_G_DIVISOR_PRE, value);
    BL_WR_REG(ISP_AWB3_BASE, ISP_MIDDLE5_AWB3_CONFIG_2, tmpVal);
}

int ISP_Set_BLC(const ISP_CLAMP_S *clamp)
{
    isp_front_reg_t *isp_front_reg = (isp_front_reg_t*)ISP_BASE;

    CHECK_PARAM_RANGE(clamp->clamp_r, ISP_BLC_MIN, ISP_BLC_MAX);
    CHECK_PARAM_RANGE(clamp->clamp_gr, ISP_BLC_MIN, ISP_BLC_MAX);
    CHECK_PARAM_RANGE(clamp->clamp_gb, ISP_BLC_MIN, ISP_BLC_MAX);
    CHECK_PARAM_RANGE(clamp->clamp_b, ISP_BLC_MIN, ISP_BLC_MAX);

    isp_front_reg->clamp_R_Gr.BF.clp_R_pre = clamp->clamp_r;
    isp_front_reg->clamp_R_Gr.BF.clp_Gr_pre = clamp->clamp_gr;
    isp_front_reg->clamp_B_Gb.BF.clp_Gb_pre = clamp->clamp_gb;
    isp_front_reg->clamp_B_Gb.BF.clp_B_pre = clamp->clamp_b;

    isp_front_reg->gain_R_G.BF.rgain1_pre = 128;
    isp_front_reg->gain_R_G.BF.ggain1_pre = 128;
    isp_front_reg->gain_B.BF.bgain1_pre = 128;

    /* compensate back the lost dynamic range for bayer image */
    isp_front_reg->clp_rgr_gain.BF.clp_gain_en_pre = 1;
    isp_front_reg->clp_rgr_gain.BF.clp_r_gain_pre = ISP_Calc_Clamp_Gain(clamp->clamp_r);
    isp_front_reg->clp_rgr_gain.BF.clp_gr_gain_pre = ISP_Calc_Clamp_Gain(clamp->clamp_gr);
    isp_front_reg->clp_bgb_gain.BF.clp_gb_gain_pre = ISP_Calc_Clamp_Gain(clamp->clamp_gb);
    isp_front_reg->clp_bgb_gain.BF.clp_b_gain_pre = ISP_Calc_Clamp_Gain(clamp->clamp_b);

    return 0;
}

void ISP_Set_RB_Gain(const ISP_RB_Gain_Type *rb_gain)
{
    ISP_RGB_Gain_Type rgb_gain;

    rgb_gain.r_gain = rb_gain->r_gain;
    rgb_gain.g_gain = 4096;
    rgb_gain.b_gain = rb_gain->b_gain;

    ISP_Set_AWB_Gain(&rgb_gain);
}

int ISP_Get_BLC(ISP_CLAMP_S *clamp)
{
    isp_front_reg_t *isp_front_reg = (isp_front_reg_t*)ISP_BASE;

    clamp->clamp_r = isp_front_reg->clamp_R_Gr.BF.clp_R_pre;
    clamp->clamp_gr = isp_front_reg->clamp_R_Gr.BF.clp_Gr_pre;
    clamp->clamp_gb = isp_front_reg->clamp_B_Gb.BF.clp_Gb_pre;
    clamp->clamp_b = isp_front_reg->clamp_B_Gb.BF.clp_B_pre;

    return 0;
}

int ISP_Get_OB_Avg(ISP_OB_S *ob)
{
    isp_front_reg_t *isp_front_reg = (isp_front_reg_t*)ISP_BASE;

    ob->ob_r  = isp_front_reg->Ob_R_Gr.BF.Ob_R_r;
    ob->ob_gr = isp_front_reg->Ob_R_Gr.BF.Ob_Gr_r;
    ob->ob_gb = isp_front_reg->Ob_B_Gb.BF.Ob_Gb_r;
    ob->ob_b  = isp_front_reg->Ob_B_Gb.BF.Ob_B_r;

    return 0;
}

void ISP_Set_DPC_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_DEFECT_SETTING);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_DEFECT_CORRECT_MODE_W, ISP_DPC_FLY);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_DEFECT_CORRECT_MODE_W, ISP_DPC_OFF);
    }
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_DEFECT_SETTING, tmpVal);
}

void ISP_Get_DPC_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_DEFECT_SETTING);
    *state = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_DEFECT_CORRECT_MODE_W);
}

void ISP_Enable_DPC(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_DEFECT_SETTING);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_DEFECT_CORRECT_MODE_W, ISP_DPC_FLY);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_DEFECT_SETTING, tmpVal);
}

void ISP_Disable_DPC(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_DEFECT_SETTING);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_DEFECT_CORRECT_MODE_W, ISP_DPC_OFF);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_DEFECT_SETTING, tmpVal);
}

int ISP_Set_Defect_Correction_Enhance_Group(const ISP_DPC_ENHANCE_GROUP_TYPE *value)
{
    int i;
    isp_middle_reg_t *isp_middle_reg = (isp_middle_reg_t*)ISP_BASE;

    for (i = 0; i < ISP_DPC_Enhance_Num; i++) {
        if ((DISABLE != value->data[i]) && (ENABLE != value->data[i]))  {
            return -1;
        }
    }

    isp_middle_reg->defect_setting.BF.resolution_enhance1_w = value->data[ISP_DPC_Enhance1];
    isp_middle_reg->defect_setting.BF.resolution_enhance2_w = value->data[ISP_DPC_Enhance2];
    isp_middle_reg->defect_setting.BF.resolution_enhance3_w = value->data[ISP_DPC_Enhance3];

    return 0;
}

int ISP_Get_Defect_Correction_Enhance_Group(ISP_DPC_ENHANCE_GROUP_TYPE *value)
{
    isp_middle_reg_t *isp_middle_reg = (isp_middle_reg_t*)ISP_BASE;

    value->data[ISP_DPC_Enhance1] = (BL_Fun_Type)isp_middle_reg->defect_setting.BF.resolution_enhance1_w;
    value->data[ISP_DPC_Enhance2] = (BL_Fun_Type)isp_middle_reg->defect_setting.BF.resolution_enhance2_w;
    value->data[ISP_DPC_Enhance3] = (BL_Fun_Type)isp_middle_reg->defect_setting.BF.resolution_enhance3_w;

    return 0;
}

int ISP_Set_Defect_Correction_Threshold_Group(const ISP_DPC_THRESHOLD_GROUP_TYPE *value)
{
    int i;
    isp_middle_reg_t *isp_middle_reg = (isp_middle_reg_t*)ISP_BASE;

    for (i = 0; i < ISP_DPC_th_Num; i++) {
        CHECK_PARAM_RANGE(value->data[i], ISP_DPC_TH_MIN, ISP_DPC_TH_MAX);
    }

    isp_middle_reg->defect_th_A.BF.defect_th1_w = value->data[ISP_DPC_th1];
    isp_middle_reg->defect_th_A.BF.defect_th2_w = value->data[ISP_DPC_th2];
    isp_middle_reg->defect_th_A.BF.defect_th3_w = value->data[ISP_DPC_th3];
    isp_middle_reg->defect_th_A.BF.defect_th4_w = value->data[ISP_DPC_th4];
    isp_middle_reg->defect_th_B.BF.defect_th5_w = value->data[ISP_DPC_th5];

    return 0;
}

int ISP_Get_Defect_Correction_Threshold_Group(ISP_DPC_THRESHOLD_GROUP_TYPE *value)
{
    isp_middle_reg_t *isp_middle_reg = (isp_middle_reg_t*)ISP_BASE;

    value->data[ISP_DPC_th1] = isp_middle_reg->defect_th_A.BF.defect_th1_w;
    value->data[ISP_DPC_th2] = isp_middle_reg->defect_th_A.BF.defect_th2_w;
    value->data[ISP_DPC_th3] = isp_middle_reg->defect_th_A.BF.defect_th3_w;
    value->data[ISP_DPC_th4] = isp_middle_reg->defect_th_A.BF.defect_th4_w;
    value->data[ISP_DPC_th5] = isp_middle_reg->defect_th_B.BF.defect_th5_w;

