bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
    return 0;
}

int ISP_Set_Defect_Postion(const int pos_x, const int pos_y)
{
    isp_middle_reg_t *isp_middle_reg = (isp_middle_reg_t*)ISP_BASE;

    CHECK_PARAM_RANGE(pos_x, ISP_DPC_POS_MIN, ISP_DPC_POS_MAX);
    CHECK_PARAM_RANGE(pos_y, ISP_DPC_POS_MIN, ISP_DPC_POS_MAX);

    isp_middle_reg->defect_position.BF.x_position_w = pos_x;
    isp_middle_reg->defect_position.BF.y_position_w = pos_y;

    return 0;
}

int ISP_Get_Defect_Postion(int *pos_x, int *pos_y)
{
    isp_middle_reg_t *isp_middle_reg = (isp_middle_reg_t*)ISP_BASE;

    *pos_x = isp_middle_reg->defect_position.BF.x_position_w;
    *pos_y = isp_middle_reg->defect_position.BF.y_position_w;

    return 0;
}

void ISP_Set_BNR_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_0);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE4_BNR_EN_PRE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MIDDLE4_BNR_EN_PRE);
    }
    BL_WR_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_0, tmpVal);
}

void ISP_Get_BNR_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_0);

    if (BL_IS_REG_BIT_SET(tmpVal, ISP_MIDDLE4_BNR_EN_PRE)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}

/*
    Set/Get BNR Weight
    value range: 0~64
*/
void ISP_Set_BNR_Weight(int value)
{
    uint32_t tmpVal;

    CHECK_PARAM_RANGE(value, ISP_BNR_WEIGHT_MIN, ISP_BNR_WEIGHT_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_BNR_WEIGHT_PRE, value);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_0, tmpVal);
}

void ISP_Get_BNR_Weight(int *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_0);
    *value = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_BNR_WEIGHT_PRE);
}

/*
    Set/Get BNR LPF Weight
    value range: 0~16
*/
void ISP_Set_BNR_LPF_Weight(int value)
{
    uint32_t tmpVal;

    CHECK_PARAM_RANGE(value, ISP_BNR_LPF_WEIGHT_MIN, ISP_BNR_LPF_WEIGHT_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_LPF_WEIGHT_PRE, value);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_0, tmpVal);
}

void ISP_Get_BNR_LPF_Weight(int *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_0);
    *value = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_LPF_WEIGHT_PRE);
}

void ISP_Set_BNR_Threshold(const ISP_BNR_THRESHOLD_TYPE *value)
{
    uint32_t tmpVal;

    CHECK_PARAM_MAX(value->th_base_r, ISP_BNR_BASE_MAX);
    CHECK_PARAM_MAX(value->th_base_g, ISP_BNR_BASE_MAX);
    CHECK_PARAM_MAX(value->th_base_b, ISP_BNR_BASE_MAX);
    CHECK_PARAM_MAX(value->th_slope_r, ISP_BNR_SLOPE_MAX);
    CHECK_PARAM_MAX(value->th_slope_g, ISP_BNR_SLOPE_MAX);
    CHECK_PARAM_MAX(value->th_slope_b, ISP_BNR_SLOPE_MAX);
    CHECK_PARAM_MAX(value->slope_gain, ISP_BNR_SLOPE_GAIN_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_TH_BASE_B_PRE, value->th_base_b);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_0, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_TH_BASE_G_PRE, value->th_base_g);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_TH_BASE_R_PRE, value->th_base_r);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_1, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_TH_SLOPE_B_PRE, value->th_slope_b);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_TH_SLOPE_G_PRE, value->th_slope_g);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_TH_SLOPE_R_PRE, value->th_slope_r);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_SLOPE_GAIN_PRE, value->slope_gain);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_2, tmpVal);
}

void ISP_Get_BNR_Threshold(ISP_BNR_THRESHOLD_TYPE *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_0);
    value->th_base_b  = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_TH_BASE_B_PRE);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_1);
    value->th_base_g  = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_TH_BASE_G_PRE);
    value->th_base_r  = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_TH_BASE_R_PRE);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_2);
    value->th_slope_b  = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_TH_SLOPE_B_PRE);
    value->th_slope_g  = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_TH_SLOPE_G_PRE);
    value->th_slope_r  = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_TH_SLOPE_R_PRE);
    value->slope_gain  = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_SLOPE_GAIN_PRE);
}

void ISP_Set_BNR_Fallback(const ISP_BNR_FALLBACK_TYPE *value)
{
    uint32_t tmpVal;

    CHECK_PARAM_MAX(value->fb_level, ISP_BNR_FB_LVL_MAX);
    CHECK_PARAM_MAX(value->fb_lpf_weight, ISP_BNR_FB_LPF_WGT_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_3);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_FB_LEVEL_PRE, value->fb_level);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_FB_LPF_WEIGHT_PRE, value->fb_lpf_weight);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_3, tmpVal);
}

void ISP_Get_BNR_Fallback(ISP_BNR_FALLBACK_TYPE *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE4_BNR_CONFIG_3);
    value->fb_lpf_weight  = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_FB_LPF_WEIGHT_PRE);
    value->fb_level  = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE4_FB_LEVEL_PRE);
}

void ISP_Set_LSC_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_SETTING);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE_LSC_ON_W);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MIDDLE_LSC_ON_W);
    }
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_SETTING, tmpVal);
}

void ISP_Enable_LSC(void)
{
    uint32_t tmpVal;

