bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_SETTING);
    tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE_LSC_ON_W);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_SETTING, tmpVal);
}

void ISP_Disable_LSC(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_SETTING);
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MIDDLE_LSC_ON_W);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_SETTING, tmpVal);
}

void ISP_Get_LSC_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_SETTING);

    if (BL_IS_REG_BIT_SET(tmpVal, ISP_MIDDLE_LSC_ON_W)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}

/*
    xoffset and yoffset caculated by active and out window
 */
int ISP_Set_LSC_Offset(int xoffset, int yoffset)
{
    isp_middle_reg_t *isp_middle_reg = (isp_middle_reg_t*)ISP_BASE;

    CHECK_PARAM_RANGE(xoffset, ISP_LSC_OFFSET_MIN, ISP_LSC_OFFSET_MAX);
    CHECK_PARAM_RANGE(yoffset, ISP_LSC_OFFSET_MIN, ISP_LSC_OFFSET_MAX);

    isp_middle_reg->LSC_setting.BF.X_offset_w = xoffset;
    isp_middle_reg->LSC_setting.BF.Y_offset_w = yoffset;

    return 0;
}

int ISP_Get_LSC_Offset(int *xoffset, int *yoffset)
{
    isp_middle_reg_t *isp_middle_reg = (isp_middle_reg_t*)ISP_BASE;

    *xoffset = isp_middle_reg->LSC_setting.BF.X_offset_w;
    *yoffset = isp_middle_reg->LSC_setting.BF.Y_offset_w;

    return 0;
}

int ISP_Set_LSC_Coeff(const ISP_LSC_COEF_S *lsc)
{
    uint32_t tmpVal;

    if (!is_LSC_Coeff_Valid(lsc)) {
        return -1;
    }

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_A);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_R_ACOEFF_W, lsc->lsc_coef_r.coef[LSC_COEF_A]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_A, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_BE);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_R_BCOEFF_W, lsc->lsc_coef_r.coef[LSC_COEF_B]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_R_ECOEFF_W, lsc->lsc_coef_r.coef[LSC_COEF_E]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_BE, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_CD);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_R_CCOEFF_W, lsc->lsc_coef_r.coef[LSC_COEF_C]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_R_DCOEFF_W, lsc->lsc_coef_r.coef[LSC_COEF_D]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_CD, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_G);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_R_GCOEFF_W, lsc->lsc_coef_r.coef[LSC_COEF_G]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_G, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_A);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_G_ACOEFF_W, lsc->lsc_coef_g.coef[LSC_COEF_A]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_A, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_BE);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_G_BCOEFF_W, lsc->lsc_coef_g.coef[LSC_COEF_B]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_G_ECOEFF_W, lsc->lsc_coef_g.coef[LSC_COEF_E]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_BE, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_CD);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_G_CCOEFF_W, lsc->lsc_coef_g.coef[LSC_COEF_C]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_G_DCOEFF_W, lsc->lsc_coef_g.coef[LSC_COEF_D]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_CD, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_G);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_G_GCOEFF_W, lsc->lsc_coef_g.coef[LSC_COEF_G]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_G, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_A);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_B_ACOEFF_W, lsc->lsc_coef_b.coef[LSC_COEF_A]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_A, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_BE);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_B_BCOEFF_W, lsc->lsc_coef_b.coef[LSC_COEF_B]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_B_ECOEFF_W, lsc->lsc_coef_b.coef[LSC_COEF_E]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_BE, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_CD);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_B_CCOEFF_W, lsc->lsc_coef_b.coef[LSC_COEF_C]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_B_DCOEFF_W, lsc->lsc_coef_b.coef[LSC_COEF_D]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_CD, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_G);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_B_GCOEFF_W, lsc->lsc_coef_b.coef[LSC_COEF_G]);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_G, tmpVal);

    return 0;
}

int ISP_Get_LSC_Coeff(ISP_LSC_COEF_S *lsc)
{
    uint32_t tmpVal;

    /* channel R */
    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_A);
    lsc->lsc_coef_r.coef[LSC_COEF_A] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_R_ACOEFF_W), 23);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_BE);
    lsc->lsc_coef_r.coef[LSC_COEF_B] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_R_BCOEFF_W), 13);
    lsc->lsc_coef_r.coef[LSC_COEF_E] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_R_ECOEFF_W), 13);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_CD);
    lsc->lsc_coef_r.coef[LSC_COEF_C] = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_R_CCOEFF_W);
    lsc->lsc_coef_r.coef[LSC_COEF_D] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_R_DCOEFF_W), 23);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_G);
    lsc->lsc_coef_r.coef[LSC_COEF_G] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_R_GCOEFF_W), 23);

    /* channel G */
    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_A);
    lsc->lsc_coef_g.coef[LSC_COEF_A] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_G_ACOEFF_W), 23);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_BE);
    lsc->lsc_coef_g.coef[LSC_COEF_B] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_G_BCOEFF_W), 13);
    lsc->lsc_coef_g.coef[LSC_COEF_E] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_G_ECOEFF_W), 13);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_CD);
    lsc->lsc_coef_g.coef[LSC_COEF_C] = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_G_CCOEFF_W);
    lsc->lsc_coef_g.coef[LSC_COEF_D] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_G_DCOEFF_W), 23);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_G);
    lsc->lsc_coef_g.coef[LSC_COEF_G] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_G_GCOEFF_W), 23);

    /* channel B */
    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_A);
    lsc->lsc_coef_b.coef[LSC_COEF_A] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_B_ACOEFF_W), 23);

