bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_BE);
    lsc->lsc_coef_b.coef[LSC_COEF_B] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_B_BCOEFF_W), 13);
    lsc->lsc_coef_b.coef[LSC_COEF_E] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_B_ECOEFF_W), 13);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_CD);
    lsc->lsc_coef_b.coef[LSC_COEF_C] = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_B_CCOEFF_W);
    lsc->lsc_coef_b.coef[LSC_COEF_D] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_B_DCOEFF_W), 23);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_G);
    lsc->lsc_coef_b.coef[LSC_COEF_G] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_B_GCOEFF_W), 23);

    return 0;
}

int ISP_Set_LSC_Coeff_Type(const int type_idx, ISP_LSC_COEF_TYPE *lsc)
{
    uint32_t tmpVal;

    if (!is_LSC_Coeff_Type_Valid(lsc)) {
        return -1;
    }

    switch(type_idx)
    {
        case 0: {
            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_A);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_R_ACOEFF_W, lsc->coef[LSC_COEF_A]);
            BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_A, tmpVal);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_BE);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_R_BCOEFF_W, lsc->coef[LSC_COEF_B]);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_R_ECOEFF_W, lsc->coef[LSC_COEF_E]);
            BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_BE, tmpVal);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_CD);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_R_CCOEFF_W, lsc->coef[LSC_COEF_C]);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_R_DCOEFF_W, lsc->coef[LSC_COEF_D]);
            BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_CD, tmpVal);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_G);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_R_GCOEFF_W, lsc->coef[LSC_COEF_G]);
            BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_G, tmpVal);
            break;
        }
        case 1: {
            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_A);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_G_ACOEFF_W, lsc->coef[LSC_COEF_A]);
            BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_A, tmpVal);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_BE);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_G_BCOEFF_W, lsc->coef[LSC_COEF_B]);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_G_ECOEFF_W, lsc->coef[LSC_COEF_E]);
            BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_BE, tmpVal);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_CD);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_G_CCOEFF_W, lsc->coef[LSC_COEF_C]);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_G_DCOEFF_W, lsc->coef[LSC_COEF_D]);
            BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_CD, tmpVal);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_G);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_G_GCOEFF_W, lsc->coef[LSC_COEF_G]);
            BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_G, tmpVal);
            break;
        }
        case 2: {
            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_A);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_B_ACOEFF_W, lsc->coef[LSC_COEF_A]);
            BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_A, tmpVal);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_BE);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_B_BCOEFF_W, lsc->coef[LSC_COEF_B]);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_B_ECOEFF_W, lsc->coef[LSC_COEF_E]);
            BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_BE, tmpVal);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_CD);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_B_CCOEFF_W, lsc->coef[LSC_COEF_C]);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_B_DCOEFF_W, lsc->coef[LSC_COEF_D]);
            BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_CD, tmpVal);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_G);
            tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_MIDDLE_B_GCOEFF_W, lsc->coef[LSC_COEF_G]);
            BL_WR_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_G, tmpVal);
            break;
        }
    }

    return 0;
}

int ISP_Get_LSC_Coeff_Type(const int type_idx, ISP_LSC_COEF_TYPE *lsc)
{
    uint32_t tmpVal;
    switch(type_idx)
    {
        case 0: {  /* channel R */
            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_A);
            lsc->coef[LSC_COEF_A] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_R_ACOEFF_W), 23);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_BE);
            lsc->coef[LSC_COEF_B] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_R_BCOEFF_W), 13);
            lsc->coef[LSC_COEF_E] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_R_ECOEFF_W), 13);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_CD);
            lsc->coef[LSC_COEF_C] = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_R_CCOEFF_W);
            lsc->coef[LSC_COEF_D] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_R_DCOEFF_W), 23);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_R_G);
            lsc->coef[LSC_COEF_G] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_R_GCOEFF_W), 23);
            break;
        }
        case 1: { /* channel G */
            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_A);
            lsc->coef[LSC_COEF_A] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_G_ACOEFF_W), 23);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_BE);
            lsc->coef[LSC_COEF_B] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_G_BCOEFF_W), 13);
            lsc->coef[LSC_COEF_E] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_G_ECOEFF_W), 13);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_CD);
            lsc->coef[LSC_COEF_C] = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_G_CCOEFF_W);
            lsc->coef[LSC_COEF_D] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_G_DCOEFF_W), 23);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_G_G);
            lsc->coef[LSC_COEF_G] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_G_GCOEFF_W), 23);
            break;
        }
        case 2: { /* channel B */
            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_A);
            lsc->coef[LSC_COEF_A] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_B_ACOEFF_W), 23);

