bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_BE);
            lsc->coef[LSC_COEF_B] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_B_BCOEFF_W), 13);
            lsc->coef[LSC_COEF_E] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_B_ECOEFF_W), 13);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_CD);
            lsc->coef[LSC_COEF_C] = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_B_CCOEFF_W);
            lsc->coef[LSC_COEF_D] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_B_DCOEFF_W), 23);

            tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_LSC_COEFF_B_G);
            lsc->coef[LSC_COEF_G] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_B_GCOEFF_W), 23);
            break;
        }
    }

    return 0;
}


int ISP_Set_LSC_Max(const ISP_LSC_MAX_S *lsc_max)
{
    isp_middle_reg_t *isp_middle_reg = (isp_middle_reg_t*)ISP_BASE;

    CHECK_PARAM_RANGE(lsc_max->max_r, ISP_LSC_MAX_MIN, ISP_LSC_MAX_MAX);
    CHECK_PARAM_RANGE(lsc_max->max_g, ISP_LSC_MAX_MIN, ISP_LSC_MAX_MAX);
    CHECK_PARAM_RANGE(lsc_max->max_b, ISP_LSC_MAX_MIN, ISP_LSC_MAX_MAX);

    isp_middle_reg->MAX_R_G.BF.MAXR_w = lsc_max->max_r;
    isp_middle_reg->MAX_R_G.BF.MAXG_w = lsc_max->max_g;
    isp_middle_reg->MAX_B.BF.MAXB_w = lsc_max->max_b;

    return 0;
}

int ISP_Get_LSC_Max(ISP_LSC_MAX_S *lsc_max)
{
    isp_middle_reg_t *isp_middle_reg = (isp_middle_reg_t*)ISP_BASE;

    lsc_max->max_r = isp_middle_reg->MAX_R_G.BF.MAXR_w;
    lsc_max->max_g = isp_middle_reg->MAX_R_G.BF.MAXG_w;
    lsc_max->max_b = isp_middle_reg->MAX_B.BF.MAXB_w;

    return 0;
}

void ISP_Set_Digital_Gain(int r_gain, int gr_gain, int gb_gain, int b_gain)
{
    uint32_t tmpVal;

    CHECK_PARAM_RANGE(r_gain, ISP_DIGITAL_GAIN_MIN, ISP_DIGITAL_GAIN_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_DIGITAL_RGR_GAIN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_DIGITAL_R_GAIN_PRE, r_gain);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_DIGITAL_GR_GAIN_PRE, gr_gain);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_DIGITAL_RGR_GAIN, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_DIGITAL_BGB_GAIN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_DIGITAL_GB_GAIN_PRE, gb_gain);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_DIGITAL_B_GAIN_PRE, b_gain);
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_DIGITAL_BGB_GAIN, tmpVal);
}

void ISP_Get_Digital_Gain(int *r_gain, int *gr_gain, int *gb_gain, int *b_gain)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_DIGITAL_RGR_GAIN);
    *r_gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_DIGITAL_R_GAIN_PRE);
    *gr_gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_DIGITAL_GR_GAIN_PRE);
    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_DIGITAL_BGB_GAIN);
    *gb_gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_DIGITAL_GB_GAIN_PRE);
    *b_gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_MIDDLE_DIGITAL_B_GAIN_PRE);
}

void ISP_Set_CFA_Int_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_CFA_INT_1);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MIDDLE_REG_CFA_FRINGE_ON_W);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MIDDLE_REG_CFA_FRINGE_ON_W);
    }
    BL_WR_REG(ISP_BASE, ISP_MIDDLE_CFA_INT_1, tmpVal);
}

void ISP_Get_CFA_Int_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_MIDDLE_CFA_INT_1);

    if (BL_IS_REG_BIT_SET(tmpVal, ISP_MIDDLE_REG_CFA_FRINGE_ON_W)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}


void ISP_Set_CCM_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_OFFSET_0);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_BLBACK_CC_ENABLE_PRE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_BLBACK_CC_ENABLE_PRE);
    }
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CC_OFFSET_0, tmpVal);
}

void ISP_Get_CCM_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_OFFSET_0);

    if (BL_IS_REG_BIT_SET(tmpVal, ISP_BLBACK_CC_ENABLE_PRE)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}


void ISP_Set_CCM_Coef(const ISP_CCM_COEF_S *ccm)
{
    int i;
    uint32_t tmpVal;

    for (i = 0; i < CCM_COEF_NUM; i++) {
        CHECK_PARAM_RANGE(ccm->ccm_coef[i], ISP_CCM_MIN, ISP_CCM_MAX);
    }

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_MATRIX_0);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CC_MATRIX00_PRE, ccm->ccm_coef[ISP_CCM_11]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CC_MATRIX01_PRE, ccm->ccm_coef[ISP_CCM_12]);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CC_MATRIX_0, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_MATRIX_1);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CC_MATRIX02_PRE, ccm->ccm_coef[ISP_CCM_13]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CC_MATRIX10_PRE, ccm->ccm_coef[ISP_CCM_21]);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CC_MATRIX_1, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_MATRIX_2);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CC_MATRIX11_PRE, ccm->ccm_coef[ISP_CCM_22]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CC_MATRIX12_PRE, ccm->ccm_coef[ISP_CCM_23]);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CC_MATRIX_2, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_MATRIX_3);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CC_MATRIX20_PRE, ccm->ccm_coef[ISP_CCM_31]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CC_MATRIX21_PRE, ccm->ccm_coef[ISP_CCM_32]);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CC_MATRIX_3, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_CE_MATRIX);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CC_MATRIX22_PRE, ccm->ccm_coef[ISP_CCM_33]);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CC_CE_MATRIX, tmpVal);
}

void ISP_Get_CCM_Coef(ISP_CCM_COEF_S *ccm)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_MATRIX_0);
    ccm->ccm_coef[ISP_CCM_11] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CC_MATRIX00_PRE), ISP_BLBACK_CC_MATRIX00_PRE_LEN);
    ccm->ccm_coef[ISP_CCM_12] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CC_MATRIX01_PRE), ISP_BLBACK_CC_MATRIX01_PRE_LEN);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_MATRIX_1);
    ccm->ccm_coef[ISP_CCM_13] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CC_MATRIX02_PRE), ISP_BLBACK_CC_MATRIX02_PRE_LEN);
    ccm->ccm_coef[ISP_CCM_21] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CC_MATRIX10_PRE), ISP_BLBACK_CC_MATRIX10_PRE_LEN);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_MATRIX_2);
    ccm->ccm_coef[ISP_CCM_22] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CC_MATRIX11_PRE), ISP_BLBACK_CC_MATRIX11_PRE_LEN);
    ccm->ccm_coef[ISP_CCM_23] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CC_MATRIX12_PRE), ISP_BLBACK_CC_MATRIX12_PRE_LEN);

