bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_MATRIX_3);
    ccm->ccm_coef[ISP_CCM_31] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CC_MATRIX20_PRE), ISP_BLBACK_CC_MATRIX20_PRE_LEN);
    ccm->ccm_coef[ISP_CCM_32] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CC_MATRIX21_PRE), ISP_BLBACK_CC_MATRIX21_PRE_LEN);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_CE_MATRIX);
    ccm->ccm_coef[ISP_CCM_33] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CC_MATRIX22_PRE), ISP_BLBACK_CC_MATRIX22_PRE_LEN);
}

void ISP_Set_CCM_Pre_Offset(const ISP_CCM_OFFSET_S *ccm)
{
    int i;
    uint32_t tmpVal;

    for (i = 0; i < CCM_OFFSET_NUM; i++) {
        CHECK_PARAM_RANGE(ccm->offset[i], ISP_CCM_OFFSET_MIN, ISP_CCM_OFFSET_MAX);
    }

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_OFFSET_0);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CC_PRE_OFFSET0_PRE, ccm->offset[ISP_CCM_OFFSET_0]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CC_PRE_OFFSET1_PRE, ccm->offset[ISP_CCM_OFFSET_1]);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CC_OFFSET_0, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_OFFSET_1);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CC_PRE_OFFSET2_PRE, ccm->offset[ISP_CCM_OFFSET_2]);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CC_OFFSET_1, tmpVal);

}

void ISP_Get_CCM_Pre_Offset(ISP_CCM_OFFSET_S *ccm)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_OFFSET_0);
    ccm->offset[ISP_CCM_OFFSET_0] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CC_PRE_OFFSET0_PRE), ISP_BLBACK_CC_PRE_OFFSET0_PRE_LEN);
    ccm->offset[ISP_CCM_OFFSET_1] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CC_PRE_OFFSET1_PRE), ISP_BLBACK_CC_PRE_OFFSET1_PRE_LEN);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_OFFSET_1);
    ccm->offset[ISP_CCM_OFFSET_2] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CC_PRE_OFFSET2_PRE), ISP_BLBACK_CC_PRE_OFFSET2_PRE_LEN);
}

void ISP_Set_CCM_Post_Offset(const ISP_CCM_OFFSET_S *ccm)
{
    int i;
    uint32_t tmpVal;

    for (i = 0; i < CCM_OFFSET_NUM; i++) {
        CHECK_PARAM_RANGE(ccm->offset[i], ISP_CCM_OFFSET_MIN, ISP_CCM_OFFSET_MAX);
    }

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_OFFSET_2);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CC_POST_OFFSET0_PRE, ccm->offset[ISP_CCM_OFFSET_0]);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CC_POST_OFFSET1_PRE, ccm->offset[ISP_CCM_OFFSET_1]);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CC_OFFSET_0, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_OFFSET_1);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CC_POST_OFFSET2_PRE, ccm->offset[ISP_CCM_OFFSET_2]);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CC_OFFSET_1, tmpVal);

}

void ISP_Get_CCM_Post_Offset(ISP_CCM_OFFSET_S *ccm)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_OFFSET_2);
    ccm->offset[ISP_CCM_OFFSET_0] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CC_POST_OFFSET0_PRE), ISP_BLBACK_CC_POST_OFFSET0_PRE_LEN);
    ccm->offset[ISP_CCM_OFFSET_1] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CC_POST_OFFSET1_PRE), ISP_BLBACK_CC_POST_OFFSET1_PRE_LEN);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_OFFSET_1);
    ccm->offset[ISP_CCM_OFFSET_2] = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CC_POST_OFFSET2_PRE), ISP_BLBACK_CC_POST_OFFSET2_PRE_LEN);
}

void ISP_Set_Gamma_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_GAMMA_A);
    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_BLBACK_BL_GAMMA_EN_PRE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_BLBACK_BL_GAMMA_EN_PRE);
    }
    BL_WR_REG(ISP_BASE, ISP_BLBACK_GAMMA_A, tmpVal);
}

void ISP_Get_Gamma_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_GAMMA_A);

    if (BL_IS_REG_BIT_SET(tmpVal, ISP_BLBACK_BL_GAMMA_EN_PRE)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}

void ISP_Set_Gamma_Coef(const ISP_Gamma_Curve_Type *gamma_curve)
{
    memcpy((uint32_t*)(ISP_BASE + ISP_BLBACK_BL_GAMMA_TABLE_1_OFFSET), (uint32_t*)&gamma_curve->curve_coef[0],
        GAMMA_COEF_NUM / 2);
}

void ISP_Get_Gamma_Coef(ISP_Gamma_Curve_Type *gamma_curve)
{
    memcpy((uint32_t*)&gamma_curve->curve_coef[0], (uint32_t*)(ISP_BASE + ISP_BLBACK_BL_GAMMA_TABLE_1_OFFSET),
        GAMMA_COEF_NUM / 2);
}

/*
    should not change, yuv range should change in yuv adjust module
*/
void ISP_Init_Color_Enhancement()
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CE_MATRIX_0);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CE_MATRIX00_PRE, 0x99);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CE_MATRIX01_PRE, 0x12D);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CE_MATRIX_0, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CC_CE_MATRIX);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CE_MATRIX02_PRE, 0x3A);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CC_CE_MATRIX, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CE_MATRIX_1);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CE_MATRIX10_PRE, 0xFA9);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CE_MATRIX11_PRE, 0xF57);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CE_MATRIX_1, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CE_MATRIX_2);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CE_MATRIX12_PRE, 0x100);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CE_MATRIX20_PRE, 0x100);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CE_MATRIX_2, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CE_MATRIX_3);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CE_MATRIX21_PRE, 0xF29);
    tmpVal = BL_SET_REG_BITS_VAL_2(tmpVal, ISP_BLBACK_CE_MATRIX22_PRE, 0xFD7);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CE_MATRIX_3, tmpVal);
}

void ISP_Set_YUV_Conv_Mode(ISP_YUV_CONV_TYPE type)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_ISP_YUV_CONV_TYPE(type));

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CONV_MODE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CONV_MODE_W, type);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CONV_MODE, tmpVal);
}

