bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
void ISP_Get_YUV_Conv_Mode(ISP_YUV_CONV_TYPE *type)
{
    *type = BL_GET_REG_BITS_VAL(BL_RD_REG(ISP_BASE, ISP_BLBACK_CONV_MODE), ISP_BLBACK_CONV_MODE_W);
}

void ISP_Set_Brightness(int value)
{
    uint32_t tmpVal;

    CHECK_PARAM_RANGE(value, ISP_BRIGHTNESS_MIN, ISP_BRIGHTNESS_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_YUVC_A);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_YBRIGHTNESS_W, value);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_YUVC_A, tmpVal);
}

void ISP_Get_Brightness(int *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_YUVC_A);
    *value = SIGN_EXTEND(BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_YBRIGHTNESS_W), ISP_BLBACK_YBRIGHTNESS_W_LEN);
}

void ISP_Set_Contrast(int value)
{
    uint32_t tmpVal;

    CHECK_PARAM_RANGE(value, ISP_CONTRAST_MIN, ISP_CONTRAST_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_YUVC_A);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_YCONTRAST_W, value);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_YUVC_A, tmpVal);
}

void ISP_Get_Contrast(int *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_YUVC_A);
    *value = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_YCONTRAST_W);
}

void ISP_Set_Saturation(const ISP_SATURATION_S *saturation)
{
    uint32_t tmpVal;

    CHECK_PARAM_MAX(saturation->saturation_cb, ISP_SATURATION_MAX);
    CHECK_PARAM_MAX(saturation->saturation_cr, ISP_SATURATION_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_YUVC_A);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CBSATURATION_PRE, saturation->saturation_cb);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CRSATURATION_PRE, saturation->saturation_cr);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_YUVC_A, tmpVal);
}

void ISP_Get_Saturation(ISP_SATURATION_S *saturation)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_YUVC_A);
    saturation->saturation_cb = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CBSATURATION_PRE);
    saturation->saturation_cr = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CRSATURATION_PRE);
}

void ISP_Set_Special_Mode(int value)
{
    uint32_t tmpVal;

    CHECK_PARAM_RANGE(value, 0, 4);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_YUVC_B);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_SPECIALMODE_W, value);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_YUVC_B, tmpVal);
}

void ISP_Get_Special_Mode(int *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_YUVC_B);
    *value = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_SPECIALMODE_W);
}

void ISP_Set_LPF_Filting_Mode(int value)
{
    uint32_t tmpVal;

    CHECK_PARAM_RANGE(value, 0, 1);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_YUVC_B);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_C444TO422FILTERINGMODE_W, value);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_YUVC_B, tmpVal);
}

void ISP_Get_LPF_Filting_Mode(int *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_YUVC_B);
    *value = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_C444TO422FILTERINGMODE_W);
}

void ISP_Set_Sepia(int SepiaCr, int SepiaCb)
{
    uint32_t tmpVal;

    CHECK_PARAM_RANGE(SepiaCr, ISP_SOLAR_SEPIA_MIN, ISP_SOLAR_SEPIA_MAX);
    CHECK_PARAM_RANGE(SepiaCb, ISP_SOLAR_SEPIA_MIN, ISP_SOLAR_SEPIA_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_YUVC_B);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_SEPIACR_W, SepiaCr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_SEPIACB_W, SepiaCb);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_YUVC_B, tmpVal);
}

void ISP_Get_Sepia(int *SepiaCr, int *SepiaCb)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_YUVC_B);
    *SepiaCr = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_SEPIACR_W);
    *SepiaCb = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_SEPIACB_W);
}

void ISP_Set_Solar_Thred(int value)
{
    uint32_t tmpVal;

    CHECK_PARAM_RANGE(value, ISP_SOLAR_THRED_MIN, ISP_SOLAR_THRED_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_YUVC_B);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_SOLARTHRED_W, value);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_YUVC_B, tmpVal);
}

void ISP_Get_Solar_Thred(int *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_YUVC_B);
    *value = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_SOLARTHRED_W);
}

void ISP_Set_Noise_Level(int value)
{
    uint32_t tmpVal;

    CHECK_PARAM_RANGE(value, ISP_NOISE_LEVEL_MIN, ISP_NOISE_LEVEL_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_DNR_A);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_NOISE_LEVEL_PRE, value);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_DNR_A, tmpVal);
}

void ISP_Get_Noise_Level(int *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_DNR_A);
    *value = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_NOISE_LEVEL_PRE);
}

void ISP_Set_2D_NR(int value)
{
    uint32_t tmpVal;

    CHECK_PARAM_RANGE(value, ISP_NR_STRENGTH_MIN, ISP_NR_STRENGTH_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_DNR_A);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_FILT_STRENGTH_2D_PRE, value);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_DNR_A, tmpVal);
}

void ISP_Get_2D_NR(int *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_DNR_A);
    *value = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_FILT_STRENGTH_2D_PRE);
}

void ISP_Set_3D_NR(const int value)
{
    uint32_t tmpVal;

    CHECK_PARAM_RANGE(value, ISP_NR_STRENGTH_MIN, ISP_NR_STRENGTH_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_DNR_A);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_FILT_STRENGTH_3D_PRE, value);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_DNR_A, tmpVal);
}

void ISP_Get_3D_NR(int *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_DNR_A);
    *value = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_FILT_STRENGTH_3D_PRE);
}

void ISP_Set_NR_HSize(const int value)
{
    uint32_t tmpVal;

    CHECK_PARAM_RANGE(value, ISP_NR_HSIZE_MIN, ISP_NR_HSIZE_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_DNR_A);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_NR_HSIZE_PRE, value);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_DNR_A, tmpVal);
}

