bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.c
void ISP_Get_ChromaSuppress_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CS2);

    if (BL_IS_REG_BIT_SET(tmpVal, ISP_BLBACK_CS2_ENABLE_PRE)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}

void ISP_Enable_ChromaSuppress(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CS2);
    tmpVal = BL_SET_REG_BIT(tmpVal, ISP_BLBACK_CS2_ENABLE_PRE);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CS2, tmpVal);
}

void ISP_Disable_ChromaSuppress(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CS2);
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_BLBACK_CS2_ENABLE_PRE);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CS2, tmpVal);
}

void ISP_Set_ChromaSuppress(const ISP_Chroma_Suppress_Type *chromaSupprCfg)
{
    uint32_t tmpVal;
    CHECK_PARAM_MAX(chromaSupprCfg->gain, ISP_CS_GAIN_MAX);
    CHECK_PARAM_MAX(chromaSupprCfg->weight, ISP_CS_WEIGHT_MAX);
    CHECK_PARAM_MAX(chromaSupprCfg->grey_thr, ISP_CS_GAIN_THR_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CS2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CS2_GAIN_PRE, chromaSupprCfg->gain);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CS2_WEIGHT_PRE, chromaSupprCfg->weight);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CS2_GREY_TH_PRE, chromaSupprCfg->grey_thr);
    BL_WR_REG(ISP_BASE, ISP_BLBACK_CS2, tmpVal);
}

void ISP_Get_ChromaSuppress(ISP_Chroma_Suppress_Type *chromaSupprCfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_BLBACK_CS2);
    chromaSupprCfg->gain = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CS2_GAIN_PRE);
    chromaSupprCfg->weight = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CS2_WEIGHT_PRE);
    chromaSupprCfg->grey_thr = BL_GET_REG_BITS_VAL(tmpVal, ISP_BLBACK_CS2_GREY_TH_PRE);
}

void ISP_Get_AF_Stats(isp_af_stats_conf_t *afStats)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_AUTO_AFWAH);
    afStats->wa_hpf1_sum = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWAH1_R);
    afStats->wa_hpf2_sum = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWAH2_R);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_AUTO_AFWBH);
    afStats->wb_hpf1_sum = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWBH1_R);
    afStats->wb_hpf2_sum = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWBH2_R);
}

void ISP_Set_AF_Stats_Conf(const ISP_AF_CONF_Type *afCfg)
{
    uint32_t tmpVal;
    CHECK_PARAM_MAX(afCfg->gamma_pattern, ISP_AF_GAMMA_PATTERN_MAX);
    CHECK_PARAM_MAX(afCfg->fcore1, ISP_AF_FCORE_MAX);
    CHECK_PARAM_MAX(afCfg->fcore2, ISP_AF_FCORE_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_AUTO_AFBAE_AFMISC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFGAMMA_W, afCfg->gamma_pattern);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_AUTO_FCORE1_W, afCfg->fcore1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_AUTO_FCORE2_W, afCfg->fcore2);
    BL_WR_REG(ISP_BASE, ISP_AUTO_AFBAE_AFMISC, tmpVal);
}

void ISP_Get_AF_Stats_Conf(ISP_AF_CONF_Type *afCfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_AUTO_AFBAE_AFMISC);
    afCfg->gamma_pattern = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFGAMMA_W);
    afCfg->fcore1 = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_FCORE1_W);
    afCfg->fcore2 = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_FCORE2_W);
}

void ISP_Set_AF_Window_A(const ISP_AF_WINDOW_Type *afWinCfg)
{
    uint32_t tmpVal;
    CHECK_PARAM_MAX(afWinCfg->start_x, ISP_AF_WIN_START_MAX);
    CHECK_PARAM_MAX(afWinCfg->start_y, ISP_AF_WIN_START_MAX);
    CHECK_PARAM_MAX(afWinCfg->end_x, ISP_AF_WIN_END_MAX);
    CHECK_PARAM_MAX(afWinCfg->end_y, ISP_AF_WIN_END_MAX);
    CHECK_PARAM_MAX(afWinCfg->sum_shift, ISP_AF_SUM_SHIFT_A_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_AUTO_AFWAS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWASX_W, afWinCfg->start_x);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWASY_W, afWinCfg->start_y);
    BL_WR_REG(ISP_BASE, ISP_AUTO_AFWAS, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_AUTO_AFWAE_AFWBS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWAEX_W, afWinCfg->end_x);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWAEY_W, afWinCfg->end_y);
    BL_WR_REG(ISP_BASE, ISP_AUTO_AFWAE_AFWBS, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_AUTO_AFBAE_AFMISC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_AUTO_SUM_SHIFT_A_W, afWinCfg->sum_shift);
    BL_WR_REG(ISP_BASE, ISP_AUTO_AFBAE_AFMISC, tmpVal);
}

void ISP_Get_AF_Window_A(ISP_AF_WINDOW_Type *afWinCfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_AUTO_AFWAS);
    afWinCfg->start_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWASX_W);
    afWinCfg->start_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWASY_W);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_AUTO_AFWAE_AFWBS);
    afWinCfg->end_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWAEX_W);
    afWinCfg->end_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWAEY_W);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_AUTO_AFBAE_AFMISC);
    afWinCfg->sum_shift = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_SUM_SHIFT_A_W);
}

void ISP_Set_AF_Window_B(const ISP_AF_WINDOW_Type *afWinCfg)
{
    uint32_t tmpVal;
    CHECK_PARAM_MAX(afWinCfg->start_x, ISP_AF_WIN_START_MAX);
    CHECK_PARAM_MAX(afWinCfg->start_y, ISP_AF_WIN_START_MAX);
    CHECK_PARAM_MAX(afWinCfg->end_x, ISP_AF_WIN_END_MAX);
    CHECK_PARAM_MAX(afWinCfg->end_y, ISP_AF_WIN_END_MAX);
    CHECK_PARAM_MAX(afWinCfg->sum_shift, ISP_AF_SUM_SHIFT_B_MAX);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_AUTO_AFWAE_AFWBS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWBSX_W, afWinCfg->start_x);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWBSY_W, afWinCfg->start_y);
    BL_WR_REG(ISP_BASE, ISP_AUTO_AFWAE_AFWBS, tmpVal);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_AUTO_AFBAE_AFMISC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWBEX_W, afWinCfg->end_x);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWBEY_W, afWinCfg->end_y);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_AUTO_SUM_SHIFT_B_W, afWinCfg->sum_shift);
    BL_WR_REG(ISP_BASE, ISP_AUTO_AFBAE_AFMISC, tmpVal);
}

void ISP_Get_AF_Window_B(ISP_AF_WINDOW_Type *afWinCfg)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_BASE, ISP_AUTO_AFWAE_AFWBS);
    afWinCfg->start_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWBSX_W);
    afWinCfg->start_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWBSY_W);

    tmpVal = BL_RD_REG(ISP_BASE, ISP_AUTO_AFBAE_AFMISC);
    afWinCfg->end_x = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWBEX_W);
    afWinCfg->end_y = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_AFWBEY_W);
    afWinCfg->sum_shift = BL_GET_REG_BITS_VAL(tmpVal, ISP_AUTO_SUM_SHIFT_B_W);
}

void ISP_SW_Reset(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_SW_RESET_ISP_SUB);
    tmpVal = BL_SET_REG_BIT(tmpVal, MM_GLB_SWRST_ISP_TSRC);
    BL_WR_REG(MM_GLB_BASE, MM_GLB_SW_RESET_ISP_SUB, tmpVal);

    bflb_platform_delay_ms(1);

    tmpVal = BL_CLR_REG_BIT(tmpVal, MM_GLB_SWRST_ISP_TSRC);
    BL_WR_REG(MM_GLB_BASE, MM_GLB_SW_RESET_ISP_SUB, tmpVal);
}

void ISP_Clock_Sel(ISP_CLK_SEL_E clk_sel, BL_Fun_Type clk_div_en, int clk_div)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_ISP_DP_CLK);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_ISP_CLK_SEL, clk_sel);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_ISP_CLK_DIV, clk_div & 0xff);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_ISP_CLK_DIV_EN, clk_div_en);
    BL_WR_REG(MM_GLB_BASE, MM_GLB_ISP_DP_CLK, tmpVal);
}

void ISP_Enable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_SW_RESET_ISP_SUB);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MM_GLB_SWRST_ISP_MAIN);
    BL_WR_REG(MM_GLB_BASE, MM_GLB_SW_RESET_ISP_SUB, tmpVal);
}

void ISP_Disable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_SW_RESET_ISP_SUB);
    tmpVal = BL_SET_REG_BIT(tmpVal, MM_GLB_SWRST_ISP_MAIN);
    BL_WR_REG(MM_GLB_BASE, MM_GLB_SW_RESET_ISP_SUB, tmpVal);
}



